
const PARA_FAC para_fac[] =
{
  /* 02 系统参数 */
    1,   6,  {     0,     0,     1, },   /* 07 掉电记忆开关机 */


   /* 03 压机设置 */
    2,   0,  {    87,    87,   133, },   /* 01 变频压机编码 */
    2,   5,  {    30,    30,    18, },   /* 06 驱动转速下限 */
    2,   6,  {   100,   100,    88, },   /* 07 驱动转速上限 */

   /* 04 风机设置 */
    3,   2,  {   900,   900,   800, },   /* 03 制冷风机最高 */
    3,   3,  {   350,   350,   650, },   /* 04 制冷风机最低 */
    3,   5,  {     2,     2,     1, },   /* 06 变频风机调速 */
    3,   8,  {    32,    32,    35, },   /* 09 制冷高风环温 */
    3,   9,  {    20,    20,    21, },   /* 10 制冷低风环温 */
    3,  10,  {    10,    10,    -7, },   /* 11 制热高风环温 */
    3,  11,  {    20,    20,    43, },   /* 12 制热低风环温 */
    3,  14,  {     1,     1,   -13, },   /* 15 制热高风蒸发 */
    3,  15,  {    18,    18,    28, },   /* 16 制热低风蒸发 */
    3,  16,  {     8,     8,    -3, },   /* 17 制热中风温度 */
    3,  19,  {   900,   900,   800, },   /* 20 制热风机最高 */
    3,  20,  {   350,   350,   650, },   /* 21 制热风机最低 */
    3,  27,  {   800,   800,   750, },   /* 28 静音最大风速 */

   /* 05 电膨设置 */
    4,   4,  {    68,    68,    20, },   /* 05 主强动作比例 */
    4,  24,  {    20,    20,    38, },   /* 25 制冷过热转换环 */
    4,  25,  {    40,    40,    57, },   /* 26 低环制冷过热1 */
    4,  26,  {    40,    40,    -5, },   /* 27 低环制冷过热2 */
    4,  27,  {    50,    50,    -7, },   /* 28 低环制冷过热3 */
    4,  31,  {    38,    38,     0, },   /* 32 制冷初开趋势环 */
    4,  32,  {    20,    20,    -8, },   /* 33 制热吸气过热10 */

   /* 06 主阀设置 */
    5,   2,  {    10,    10,     9, },   /* 03 制冷初开放大 */
    5,   3,  {    10,    10,     7, },   /* 04 制热初开放大1 */
    5,   4,  {    10,    10,     8, },   /* 05 制热初开放大2 */
    5,   5,  {    12,    12,    10, },   /* 06 制热初开放大3 */
    5,   8,  {    45,    45,    50, },   /* 09 制冷初开下限 */
    5,   9,  {    85,    85,   100, },   /* 10 制冷初开上限 */
    5,  10,  {    40,    40,    14, },   /* 11 制热初开下限 */
    5,  11,  {    68,    68,   100, },   /* 12 制热初开上限 */
    5,  13,  {    30,    30,    65, },   /* 14 制冷吸气过热1 */
    5,  14,  {    30,    30,     0, },   /* 15 制冷吸气过热2 */
    5,  15,  {    30,    30,     0, },   /* 16 制冷吸气过热3 */
    5,  18,  {    20,    20,    29, },   /* 19 制热吸气过热1 */
    5,  19,  {    20,    20,     0, },   /* 20 制热吸气过热2 */
    5,  20,  {    20,    20,   -11, },   /* 21 制热吸气过热3 */
    5,  21,  {    20,    20,     4, },   /* 22 制热吸气过热4 */
    5,  22,  {    20,    20,    -8, },   /* 23 制热吸气过热5 */
    5,  23,  {    20,    20,   -10, },   /* 24 制热吸气过热6 */
    5,  24,  {    20,    20,   -10, },   /* 25 制热吸气过热7 */
    5,  25,  {    20,    20,   -11, },   /* 26 制热吸气过热8 */
    5,  26,  {    20,    20,    -8, },   /* 27 制热吸气过热9 */
    5,  27,  {    27,    27,    31, },   /* 28 强关小蒸发上限 */
    5,  36,  {    20,    20,    11, },   /* 37 制热最小开度1 */
    5,  37,  {    18,    18,    11, },   /* 38 制热最小开度2 */
    5,  38,  {    16,    16,    11, },   /* 39 制热最小开度3 */
    5,  39,  {    14,    14,    11, },   /* 40 制热最小开度4 */
    5,  40,  {    16,    16,    11, },   /* 41 制热最小开度5 */
    5,  41,  {    20,    20,    45, },   /* 42 制冷最小开度1 */
    5,  42,  {    18,    18,    45, },   /* 43 制冷最小开度2 */
    5,  43,  {    16,    16,    45, },   /* 44 制冷最小开度3 */
    5,  44,  {    14,    14,    45, },   /* 45 制冷最小开度4 */
    5,  45,  {    12,    12,    45, },   /* 46 制冷最小开度5 */

   /* 07 辅阀设置 */
    6,  10,  {    20,    20,    25, },   /* 11 制热初始开度3 */
    6,  11,  {    25,    25,    40, },   /* 12 制热初始开度4 */
    6,  28,  {     1,     1,     2, },   /* 29 排过温度系数 */
    6,  29,  {   260,   260,   200, },   /* 30 制热排气过热1 */
    6,  30,  {   280,   280,   220, },   /* 31 制热排气过热2 */
    6,  31,  {   310,   310,   220, },   /* 32 制热排气过热3 */
    6,  32,  {   340,   340,   220, },   /* 33 制热排气过热4 */
    6,  33,  {   360,   360,   220, },   /* 34 制热排气过热5 */

   /* 11 开关量及探头 */
   10,  41,  {     1,     1,     0, },   /* 42 总出水温度探头 */

   /* 13 能量控制 */
   12,  12,  {   -35,   -35,   -37, },   /* 13 制热最低环温 */
   12,  14,  {   -26,   -26,   -37, },   /* 15 热水最低环温 */

   /* 14 工程设置 */
   13,   0,  {     3,     3,     2, },   /* 01 变频水泵控制 */
   13,   2,  {  3000,  3000,  3700, },   /* 03 水泵目标转速 */
   13,   4,  {  1400,  1400,  1720, },   /* 05 水泵目标流量 */

   /* 15 工况频率表 */
   14,   2,  {    80,    80,    83, },   /* 03 冷上环35回05 */
   14,   3,  {    60,    60,    50, },   /* 04 冷上环-5回05 */
   14,   5,  {    64,    64,    68, },   /* 06 冷上环43回15 */
   14,   6,  {    70,    70,    83, },   /* 07 冷上环35回15 */
   14,   7,  {    55,    55,    54, },   /* 08 冷上环-5回15 */
   14,   8,  {    45,    45,    53, },   /* 09 冷上环50回23 */
   14,   9,  {    64,    64,    71, },   /* 10 冷上环43回23 */
   14,  10,  {    70,    70,    74, },   /* 11 冷上环35回23 */
   14,  11,  {    55,    55,    60, },   /* 12 冷上环-5回23 */
   14,  12,  {    40,    40,    49, },   /* 13 冷上环50回35 */
   14,  13,  {    52,    52,    58, },   /* 14 冷上环43回35 */
   14,  14,  {    56,    56,    58, },   /* 15 冷上环35回35 */
   14,  16,  {    25,    25,    30, },   /* 17 冷下环50 */
   14,  17,  {    25,    25,    30, },   /* 18 冷下环43 */
   14,  18,  {    25,    25,    30, },   /* 19 冷下环35 */
   14,  19,  {    25,    25,    30, },   /* 20 冷下环-5 */
   14,  20,  {    62,    62,    45, },   /* 21 热上环43回15 */
   14,  21,  {    72,    72,    68, },   /* 22 热上环07回15 */
   14,  22,  {    72,    72,    68, },   /* 23 热上环00回15 */
   14,  23,  {    76,    76,    80, },   /* 24 热上环-07回15 */
   14,  24,  {    76,    76,    80, },   /* 25 热上环-12回15 */
   14,  26,  {    52,    52,    50, },   /* 27 热上环43回30(50) */
   14,  27,  {    72,    72,    73, },   /* 28 热上环07回30(50) */
   14,  28,  {    72,    72,    73, },   /* 29 热上环00回30(50) */
   14,  29,  {    78,    78,    88, },   /* 30 热上环-07回30(50) */
   14,  30,  {    80,    80,    88, },   /* 31 热上环-12回30(50) */
   14,  31,  {    80,    80,    88, },   /* 32 热上环-25回30(50) */
   14,  32,  {    52,    52,    50, },   /* 33 热上环43回40(62) */
   14,  33,  {    72,    72,    73, },   /* 34 热上环07回40(62) */
   14,  34,  {    72,    72,    73, },   /* 35 热上环00回40(62) */
   14,  35,  {    78,    78,    88, },   /* 36 热上环-07回40(62) */
   14,  36,  {    80,    80,    88, },   /* 37 热上环-12回40(62) */
   14,  37,  {    80,    80,    88, },   /* 38 热上环-25回40(62) */
   14,  39,  {    72,    72,    73, },   /* 40 热上环07回55(75) */
   14,  40,  {    72,    72,    73, },   /* 41 热上环00回55(75) */
   14,  41,  {    78,    78,    88, },   /* 42 热上环-07回55(75) */
   14,  42,  {    80,    80,    88, },   /* 43 热上环-12回55(75) */
   14,  43,  {    80,    80,    88, },   /* 44 热上环-25回55(75) */
   14,  44,  {    25,    25,    30, },   /* 45 热下环43 */
   14,  45,  {    25,    25,    35, },   /* 46 热下环00 */
};

/* 能力测试预设参数 */
#define AT_PS_GP  8         /* 制热预设组数，不含原始组，最多允许定义11组 */
#define AT_MAX_NEW  (AT_MAX+AT_PS_GP*AT_HT_WC_NUM)

const I16 AT_presets[AT_PS_GP][AT_HT_PARA_NUM][MAC_MAX] =
{
    /* 预设组1 */
    {
        {    73,    73,    73,   },  /* 02 制热压机转速A */
        {   750,   750,   750,   },  /* 03 制热风机转速A */
        {  1173,  1173,  1173,   },  /* 04 制热主阀控制A */
        {    73,    73,    73,   },  /* 05 制热压机转速B */
        {   750,   750,   750,   },  /* 06 制热风机转速B */
        {  1146,  1146,  1146,   },  /* 07 制热主阀控制B */
        {    73,    73,    73,   },  /* 08 制热压机转速E */
        {   750,   750,   750,   },  /* 09 制热风机转速E */
        {  1127,  1127,  1127,   },  /* 10 制热主阀控制E */
        {    83,    83,    83,   },  /* 11 制热压机转速G */
        {   800,   800,   800,   },  /* 12 制热风机转速G */
        {  1240,  1240,  1240,   },  /* 13 制热主阀控制G */
        {    83,    83,    83,   },  /* 14 制热压机转速C */
        {   800,   800,   800,   },  /* 15 制热风机转速C */
        {  1322,  1322,  1322,   },  /* 16 制热主阀控制C */
        {    70,    70,    70,   },  /* 17 制热压机转速D */
        {   800,   800,   800,   },  /* 18 制热风机转速D */
        {  1000,  1000,  1000,   },  /* 19 制热主阀控制D */
        {     6,     6,     6,   },  /* 23 制热除霜环翅A */
        {   540,   540,   540,   },  /* 24 制热除霜间隔A */
        {   400,   400,   400,   },  /* 25 制热除霜开度A */
        {    70,    70,    70,   },  /* 26 制热除霜转速A */
        {     5,     5,     5,   },  /* 27 制热退除霜翅温A */
        {   600,   600,   600,   },  /* 28 制热除霜时间A */
        {     6,     6,     6,   },  /* 29 制热除霜环翅B */
        {   540,   540,   540,   },  /* 30 制热除霜间隔B */
        {   400,   400,   400,   },  /* 31 制热除霜开度B */
        {    70,    70,    70,   },  /* 32 制热除霜转速B */
        {     5,     5,     5,   },  /* 33 制热退除霜翅温B */
        {   600,   600,   600,   },  /* 34 制热除霜时间B */
        {     6,     6,     6,   },  /* 35 制热除霜环翅E */
        {   540,   540,   540,   },  /* 36 制热除霜间隔E */
        {   400,   400,   400,   },  /* 37 制热除霜开度E */
        {    70,    70,    70,   },  /* 38 制热除霜转速E */
        {     5,     5,     5,   },  /* 39 制热退除霜翅温E */
        {   600,   600,   600,   },  /* 40 制热除霜时间E */
        {     6,     6,     6,   },  /* 41 制热除霜环翅G */
        {   540,   540,   540,   },  /* 42 制热除霜间隔G */
        {   400,   400,   400,   },  /* 43 制热除霜开度G */
        {    70,    70,    70,   },  /* 44 制热除霜转速G */
        {     5,     5,     5,   },  /* 45 制热退除霜翅温G */
        {   600,   600,   600,   },  /* 46 制热除霜时间G */
    },
    /* 预设组2 */
    {
        {    76,    76,    76,   },  /* 02 制热压机转速A */
        {   750,   750,   750,   },  /* 03 制热风机转速A */
        {  1105,  1105,  1105,   },  /* 04 制热主阀控制A */
        {    35,    35,    35,   },  /* 05 制热压机转速B */
        {   700,   700,   700,   },  /* 06 制热风机转速B */
        {  1085,  1085,  1085,   },  /* 07 制热主阀控制B */
        {    88,    88,    88,   },  /* 08 制热压机转速E */
        {   800,   800,   800,   },  /* 09 制热风机转速E */
        {  1104,  1104,  1104,   },  /* 10 制热主阀控制E */
        {    70,    70,    70,   },  /* 11 制热压机转速G */
        {   800,   800,   800,   },  /* 12 制热风机转速G */
        {  1000,  1000,  1000,   },  /* 13 制热主阀控制G */
        {    23,    23,    23,   },  /* 14 制热压机转速C */
        {   550,   550,   550,   },  /* 15 制热风机转速C */
        {  1086,  1086,  1086,   },  /* 16 制热主阀控制C */
        {    18,    18,    18,   },  /* 17 制热压机转速D */
        {   400,   400,   400,   },  /* 18 制热风机转速D */
        {  1091,  1091,  1091,   },  /* 19 制热主阀控制D */
        {     6,     6,     6,   },  /* 23 制热除霜环翅A */
        {   540,   540,   540,   },  /* 24 制热除霜间隔A */
        {   400,   400,   400,   },  /* 25 制热除霜开度A */
        {    70,    70,    70,   },  /* 26 制热除霜转速A */
        {     5,     5,     5,   },  /* 27 制热退除霜翅温A */
        {   600,   600,   600,   },  /* 28 制热除霜时间A */
        {     6,     6,     6,   },  /* 29 制热除霜环翅B */
        {   540,   540,   540,   },  /* 30 制热除霜间隔B */
        {   400,   400,   400,   },  /* 31 制热除霜开度B */
        {    70,    70,    70,   },  /* 32 制热除霜转速B */
        {     5,     5,     5,   },  /* 33 制热退除霜翅温B */
        {   600,   600,   600,   },  /* 34 制热除霜时间B */
        {     6,     6,     6,   },  /* 35 制热除霜环翅E */
        {   540,   540,   540,   },  /* 36 制热除霜间隔E */
        {   400,   400,   400,   },  /* 37 制热除霜开度E */
        {    70,    70,    70,   },  /* 38 制热除霜转速E */
        {     5,     5,     5,   },  /* 39 制热退除霜翅温E */
        {   600,   600,   600,   },  /* 40 制热除霜时间E */
        {     6,     6,     6,   },  /* 41 制热除霜环翅G */
        {   540,   540,   540,   },  /* 42 制热除霜间隔G */
        {   400,   400,   400,   },  /* 43 制热除霜开度G */
        {    70,    70,    70,   },  /* 44 制热除霜转速G */
        {     5,     5,     5,   },  /* 45 制热退除霜翅温G */
        {   600,   600,   600,   },  /* 46 制热除霜时间G */
    },
    /* 预设组3 */
    {
        {    76,    76,    76,   },  /* 02 制热压机转速A */
        {   750,   750,   750,   },  /* 03 制热风机转速A */
        {  1092,  1092,  1092,   },  /* 04 制热主阀控制A */
        {    35,    35,    35,   },  /* 05 制热压机转速B */
        {   750,   750,   750,   },  /* 06 制热风机转速B */
        {  1078,  1078,  1078,   },  /* 07 制热主阀控制B */
        {    88,    88,    88,   },  /* 08 制热压机转速E */
        {   800,   800,   800,   },  /* 09 制热风机转速E */
        {  1094,  1094,  1094,   },  /* 10 制热主阀控制E */
        {    70,    70,    70,   },  /* 11 制热压机转速G */
        {   800,   800,   800,   },  /* 12 制热风机转速G */
        {  1000,  1000,  1000,   },  /* 13 制热主阀控制G */
        {    23,    23,    23,   },  /* 14 制热压机转速C */
        {   550,   550,   550,   },  /* 15 制热风机转速C */
        {  1079,  1079,  1079,   },  /* 16 制热主阀控制C */
        {    18,    18,    18,   },  /* 17 制热压机转速D */
        {   400,   400,   400,   },  /* 18 制热风机转速D */
        {  1081,  1081,  1081,   },  /* 19 制热主阀控制D */
        {     6,     6,     6,   },  /* 23 制热除霜环翅A */
        {   540,   540,   540,   },  /* 24 制热除霜间隔A */
        {   400,   400,   400,   },  /* 25 制热除霜开度A */
        {    70,    70,    70,   },  /* 26 制热除霜转速A */
        {     5,     5,     5,   },  /* 27 制热退除霜翅温A */
        {   600,   600,   600,   },  /* 28 制热除霜时间A */
        {     6,     6,     6,   },  /* 29 制热除霜环翅B */
        {   540,   540,   540,   },  /* 30 制热除霜间隔B */
        {   400,   400,   400,   },  /* 31 制热除霜开度B */
        {    70,    70,    70,   },  /* 32 制热除霜转速B */
        {     5,     5,     5,   },  /* 33 制热退除霜翅温B */
        {   600,   600,   600,   },  /* 34 制热除霜时间B */
        {     6,     6,     6,   },  /* 35 制热除霜环翅E */
        {   540,   540,   540,   },  /* 36 制热除霜间隔E */
        {   400,   400,   400,   },  /* 37 制热除霜开度E */
        {    70,    70,    70,   },  /* 38 制热除霜转速E */
        {     5,     5,     5,   },  /* 39 制热退除霜翅温E */
        {   600,   600,   600,   },  /* 40 制热除霜时间E */
        {     6,     6,     6,   },  /* 41 制热除霜环翅G */
        {   540,   540,   540,   },  /* 42 制热除霜间隔G */
        {   400,   400,   400,   },  /* 43 制热除霜开度G */
        {    70,    70,    70,   },  /* 44 制热除霜转速G */
        {     5,     5,     5,   },  /* 45 制热退除霜翅温G */
        {   600,   600,   600,   },  /* 46 制热除霜时间G */
    },
    /* 预设组4 */
    {
        {    76,    76,    76,   },  /* 02 制热压机转速A */
        {   750,   750,   750,   },  /* 03 制热风机转速A */
        {  1083,  1083,  1083,   },  /* 04 制热主阀控制A */
        {    35,    35,    35,   },  /* 05 制热压机转速B */
        {   700,   700,   700,   },  /* 06 制热风机转速B */
        {  1072,  1072,  1072,   },  /* 07 制热主阀控制B */
        {    88,    88,    88,   },  /* 08 制热压机转速E */
        {   800,   800,   800,   },  /* 09 制热风机转速E */
        {  1085,  1085,  1085,   },  /* 10 制热主阀控制E */
        {    70,    70,    70,   },  /* 11 制热压机转速G */
        {   800,   800,   800,   },  /* 12 制热风机转速G */
        {  1000,  1000,  1000,   },  /* 13 制热主阀控制G */
        {    25,    25,    25,   },  /* 14 制热压机转速C */
        {   550,   550,   550,   },  /* 15 制热风机转速C */
        {  1070,  1070,  1070,   },  /* 16 制热主阀控制C */
        {    18,    18,    18,   },  /* 17 制热压机转速D */
        {   400,   400,   400,   },  /* 18 制热风机转速D */
        {  1078,  1078,  1078,   },  /* 19 制热主阀控制D */
        {     6,     6,     6,   },  /* 23 制热除霜环翅A */
        {   540,   540,   540,   },  /* 24 制热除霜间隔A */
        {   400,   400,   400,   },  /* 25 制热除霜开度A */
        {    70,    70,    70,   },  /* 26 制热除霜转速A */
        {     5,     5,     5,   },  /* 27 制热退除霜翅温A */
        {   600,   600,   600,   },  /* 28 制热除霜时间A */
        {     6,     6,     6,   },  /* 29 制热除霜环翅B */
        {   540,   540,   540,   },  /* 30 制热除霜间隔B */
        {   400,   400,   400,   },  /* 31 制热除霜开度B */
        {    70,    70,    70,   },  /* 32 制热除霜转速B */
        {     5,     5,     5,   },  /* 33 制热退除霜翅温B */
        {   600,   600,   600,   },  /* 34 制热除霜时间B */
        {     6,     6,     6,   },  /* 35 制热除霜环翅E */
        {   540,   540,   540,   },  /* 36 制热除霜间隔E */
        {   400,   400,   400,   },  /* 37 制热除霜开度E */
        {    70,    70,    70,   },  /* 38 制热除霜转速E */
        {     5,     5,     5,   },  /* 39 制热退除霜翅温E */
        {   600,   600,   600,   },  /* 40 制热除霜时间E */
        {     6,     6,     6,   },  /* 41 制热除霜环翅G */
        {   540,   540,   540,   },  /* 42 制热除霜间隔G */
        {   400,   400,   400,   },  /* 43 制热除霜开度G */
        {    70,    70,    70,   },  /* 44 制热除霜转速G */
        {     5,     5,     5,   },  /* 45 制热退除霜翅温G */
        {   600,   600,   600,   },  /* 46 制热除霜时间G */
    },
    /* 预设组5 */
    {
        {    38,    38,    38,   },  /* 02 制热压机转速A */
        {   500,   500,   500,   },  /* 03 制热风机转速A */
        {  1064,  1064,  1064,   },  /* 04 制热主阀控制A */
        {    20,    20,    20,   },  /* 05 制热压机转速B */
        {   550,   550,   550,   },  /* 06 制热风机转速B */
        {  1064,  1064,  1064,   },  /* 07 制热主阀控制B */
        {    88,    88,    88,   },  /* 08 制热压机转速E */
        {   800,   800,   800,   },  /* 09 制热风机转速E */
        {  1073,  1073,  1073,   },  /* 10 制热主阀控制E */
        {    63,    63,    63,   },  /* 11 制热压机转速G */
        {   800,   800,   800,   },  /* 12 制热风机转速G */
        {  1072,  1072,  1072,   },  /* 13 制热主阀控制G */
        {    20,    20,    20,   },  /* 14 制热压机转速C */
        {   550,   550,   550,   },  /* 15 制热风机转速C */
        {  1079,  1079,  1079,   },  /* 16 制热主阀控制C */
        {    18,    18,    18,   },  /* 17 制热压机转速D */
        {   400,   400,   400,   },  /* 18 制热风机转速D */
        {  1091,  1091,  1091,   },  /* 19 制热主阀控制D */
        {     6,     6,     6,   },  /* 23 制热除霜环翅A */
        {   540,   540,   540,   },  /* 24 制热除霜间隔A */
        {   400,   400,   400,   },  /* 25 制热除霜开度A */
        {    70,    70,    70,   },  /* 26 制热除霜转速A */
        {     5,     5,     5,   },  /* 27 制热退除霜翅温A */
        {   600,   600,   600,   },  /* 28 制热除霜时间A */
        {     6,     6,     6,   },  /* 29 制热除霜环翅B */
        {   540,   540,   540,   },  /* 30 制热除霜间隔B */
        {   400,   400,   400,   },  /* 31 制热除霜开度B */
        {    70,    70,    70,   },  /* 32 制热除霜转速B */
        {     5,     5,     5,   },  /* 33 制热退除霜翅温B */
        {   600,   600,   600,   },  /* 34 制热除霜时间B */
        {     6,     6,     6,   },  /* 35 制热除霜环翅E */
        {   540,   540,   540,   },  /* 36 制热除霜间隔E */
        {   400,   400,   400,   },  /* 37 制热除霜开度E */
        {    70,    70,    70,   },  /* 38 制热除霜转速E */
        {     5,     5,     5,   },  /* 39 制热退除霜翅温E */
        {   600,   600,   600,   },  /* 40 制热除霜时间E */
        {     6,     6,     6,   },  /* 41 制热除霜环翅G */
        {   540,   540,   540,   },  /* 42 制热除霜间隔G */
        {   400,   400,   400,   },  /* 43 制热除霜开度G */
        {    70,    70,    70,   },  /* 44 制热除霜转速G */
        {     5,     5,     5,   },  /* 45 制热退除霜翅温G */
        {   600,   600,   600,   },  /* 46 制热除霜时间G */
    },
    /* 预设组6 */
    {
        {    40,    40,    40,   },  /* 02 制热压机转速A */
        {   500,   500,   500,   },  /* 03 制热风机转速A */
        {  1062,  1062,  1062,   },  /* 04 制热主阀控制A */
        {    20,    20,    20,   },  /* 05 制热压机转速B */
        {   560,   560,   560,   },  /* 06 制热风机转速B */
        {  1059,  1059,  1059,   },  /* 07 制热主阀控制B */
        {    88,    88,    88,   },  /* 08 制热压机转速E */
        {   800,   800,   800,   },  /* 09 制热风机转速E */
        {  1065,  1065,  1065,   },  /* 10 制热主阀控制E */
        {    63,    63,    63,   },  /* 11 制热压机转速G */
        {   800,   800,   800,   },  /* 12 制热风机转速G */
        {  1065,  1065,  1065,   },  /* 13 制热主阀控制G */
        {    20,    20,    20,   },  /* 14 制热压机转速C */
        {   550,   550,   550,   },  /* 15 制热风机转速C */
        {  1073,  1073,  1073,   },  /* 16 制热主阀控制C */
        {    18,    18,    18,   },  /* 17 制热压机转速D */
        {   400,   400,   400,   },  /* 18 制热风机转速D */
        {  1086,  1086,  1086,   },  /* 19 制热主阀控制D */
        {     6,     6,     6,   },  /* 23 制热除霜环翅A */
        {   540,   540,   540,   },  /* 24 制热除霜间隔A */
        {   400,   400,   400,   },  /* 25 制热除霜开度A */
        {    70,    70,    70,   },  /* 26 制热除霜转速A */
        {     5,     5,     5,   },  /* 27 制热退除霜翅温A */
        {   600,   600,   600,   },  /* 28 制热除霜时间A */
        {     6,     6,     6,   },  /* 29 制热除霜环翅B */
        {   540,   540,   540,   },  /* 30 制热除霜间隔B */
        {   400,   400,   400,   },  /* 31 制热除霜开度B */
        {    70,    70,    70,   },  /* 32 制热除霜转速B */
        {     5,     5,     5,   },  /* 33 制热退除霜翅温B */
        {   600,   600,   600,   },  /* 34 制热除霜时间B */
        {     6,     6,     6,   },  /* 35 制热除霜环翅E */
        {   540,   540,   540,   },  /* 36 制热除霜间隔E */
        {   400,   400,   400,   },  /* 37 制热除霜开度E */
        {    70,    70,    70,   },  /* 38 制热除霜转速E */
        {     5,     5,     5,   },  /* 39 制热退除霜翅温E */
        {   600,   600,   600,   },  /* 40 制热除霜时间E */
        {     6,     6,     6,   },  /* 41 制热除霜环翅G */
        {   540,   540,   540,   },  /* 42 制热除霜间隔G */
        {   400,   400,   400,   },  /* 43 制热除霜开度G */
        {    70,    70,    70,   },  /* 44 制热除霜转速G */
        {     5,     5,     5,   },  /* 45 制热退除霜翅温G */
        {   600,   600,   600,   },  /* 46 制热除霜时间G */
    },
    /* 预设组7 */
    {
        {    40,    40,    40,   },  /* 02 制热压机转速A */
        {   500,   500,   500,   },  /* 03 制热风机转速A */
        {  1056,  1056,  1056,   },  /* 04 制热主阀控制A */
        {    21,    21,    21,   },  /* 05 制热压机转速B */
        {   550,   550,   550,   },  /* 06 制热风机转速B */
        {  1060,  1060,  1060,   },  /* 07 制热主阀控制B */
        {    88,    88,    88,   },  /* 08 制热压机转速E */
        {   800,   800,   800,   },  /* 09 制热风机转速E */
        {  1062,  1062,  1062,   },  /* 10 制热主阀控制E */
        {    64,    64,    64,   },  /* 11 制热压机转速G */
        {   800,   800,   800,   },  /* 12 制热风机转速G */
        {  1062,  1062,  1062,   },  /* 13 制热主阀控制G */
        {    20,    20,    20,   },  /* 14 制热压机转速C */
        {   550,   550,   550,   },  /* 15 制热风机转速C */
        {  1071,  1071,  1071,   },  /* 16 制热主阀控制C */
        {    18,    18,    18,   },  /* 17 制热压机转速D */
        {   400,   400,   400,   },  /* 18 制热风机转速D */
        {  1082,  1082,  1082,   },  /* 19 制热主阀控制D */
        {     6,     6,     6,   },  /* 23 制热除霜环翅A */
        {   540,   540,   540,   },  /* 24 制热除霜间隔A */
        {   400,   400,   400,   },  /* 25 制热除霜开度A */
        {    70,    70,    70,   },  /* 26 制热除霜转速A */
        {     5,     5,     5,   },  /* 27 制热退除霜翅温A */
        {   600,   600,   600,   },  /* 28 制热除霜时间A */
        {     6,     6,     6,   },  /* 29 制热除霜环翅B */
        {   540,   540,   540,   },  /* 30 制热除霜间隔B */
        {   400,   400,   400,   },  /* 31 制热除霜开度B */
        {    70,    70,    70,   },  /* 32 制热除霜转速B */
        {     5,     5,     5,   },  /* 33 制热退除霜翅温B */
        {   600,   600,   600,   },  /* 34 制热除霜时间B */
        {     6,     6,     6,   },  /* 35 制热除霜环翅E */
        {   540,   540,   540,   },  /* 36 制热除霜间隔E */
        {   400,   400,   400,   },  /* 37 制热除霜开度E */
        {    70,    70,    70,   },  /* 38 制热除霜转速E */
        {     5,     5,     5,   },  /* 39 制热退除霜翅温E */
        {   600,   600,   600,   },  /* 40 制热除霜时间E */
        {     6,     6,     6,   },  /* 41 制热除霜环翅G */
        {   540,   540,   540,   },  /* 42 制热除霜间隔G */
        {   400,   400,   400,   },  /* 43 制热除霜开度G */
        {    70,    70,    70,   },  /* 44 制热除霜转速G */
        {     5,     5,     5,   },  /* 45 制热退除霜翅温G */
        {   600,   600,   600,   },  /* 46 制热除霜时间G */
    },
    /* 预设组8 */
    {
        {    51,    51,    51,   },  /* 02 制热压机转速A */
        {   800,   800,   800,   },  /* 03 制热风机转速A */
        {  1068,  1068,  1068,   },  /* 04 制热主阀控制A */
        {    51,    51,    51,   },  /* 05 制热压机转速B */
        {   800,   800,   800,   },  /* 06 制热风机转速B */
        {  1060,  1060,  1060,   },  /* 07 制热主阀控制B */
        {    51,    51,    51,   },  /* 08 制热压机转速E */
        {   800,   800,   800,   },  /* 09 制热风机转速E */
        {  1056,  1056,  1056,   },  /* 10 制热主阀控制E */
        {    70,    70,    70,   },  /* 11 制热压机转速G */
        {   800,   800,   800,   },  /* 12 制热风机转速G */
        {  1000,  1000,  1000,   },  /* 13 制热主阀控制G */
        {    23,    23,    23,   },  /* 14 制热压机转速C */
        {   550,   550,   550,   },  /* 15 制热风机转速C */
        {  1079,  1079,  1079,   },  /* 16 制热主阀控制C */
        {    18,    18,    18,   },  /* 17 制热压机转速D */
        {   400,   400,   400,   },  /* 18 制热风机转速D */
        {  1081,  1081,  1081,   },  /* 19 制热主阀控制D */
        {     6,     6,     6,   },  /* 23 制热除霜环翅A */
        {   540,   540,   540,   },  /* 24 制热除霜间隔A */
        {   400,   400,   400,   },  /* 25 制热除霜开度A */
        {    70,    70,    70,   },  /* 26 制热除霜转速A */
        {     5,     5,     5,   },  /* 27 制热退除霜翅温A */
        {   600,   600,   600,   },  /* 28 制热除霜时间A */
        {     6,     6,     6,   },  /* 29 制热除霜环翅B */
        {   540,   540,   540,   },  /* 30 制热除霜间隔B */
        {   400,   400,   400,   },  /* 31 制热除霜开度B */
        {    70,    70,    70,   },  /* 32 制热除霜转速B */
        {     5,     5,     5,   },  /* 33 制热退除霜翅温B */
        {   600,   600,   600,   },  /* 34 制热除霜时间B */
        {     6,     6,     6,   },  /* 35 制热除霜环翅E */
        {   540,   540,   540,   },  /* 36 制热除霜间隔E */
        {   400,   400,   400,   },  /* 37 制热除霜开度E */
        {    70,    70,    70,   },  /* 38 制热除霜转速E */
        {     5,     5,     5,   },  /* 39 制热退除霜翅温E */
        {   600,   600,   600,   },  /* 40 制热除霜时间E */
        {     6,     6,     6,   },  /* 41 制热除霜环翅G */
        {   540,   540,   540,   },  /* 42 制热除霜间隔G */
        {   400,   400,   400,   },  /* 43 制热除霜开度G */
        {    70,    70,    70,   },  /* 44 制热除霜转速G */
        {     5,     5,     5,   },  /* 45 制热退除霜翅温G */
        {   600,   600,   600,   },  /* 46 制热除霜时间G */
    },
};

/* ================================================================================================= */
const PARAM para_item_01[] = /* 1用户参数 */
{
    {   1  ,                2  ,  SET_MODE_MAX-1,           UINT_0,          }, /* 01 控制模式 */
    {LOEST_COOL-INOUT_DIFF, 5  ,    HIEST_COOL,             UINT_C,          }, /* 02 制冷设定温度 */
    {LOEST_HEAT,            60 ,    HIEST_HEAT+INOUT_DIFF,  UINT_C,          }, /* 03 制热设定温度 */
    {LOEST_HOTW,            55 ,    HIEST_HOTW,             UINT_C,          }, /* 04 热水设定温度 */
    {   16 ,                26,         30,                 UINT_C,          }, /* 05 制冷设定室温 */
    {   16 ,                20,         30,                 UINT_C,          }, /* 06 制热设定室温 */
    {LOEST_COOL-INOUT_DIFF, 5  ,    HIEST_COOL,             UINT_C|D_HIDE,   }, /* 07 制冷设定温度(B) */
    {   16 ,                16,         30,                 UINT_C|D_HIDE,   }, /* 08 制冷设定室温(B) */
    {LOEST_HEAT,            60 ,    HIEST_HEAT+INOUT_DIFF,  UINT_C,          }, /* 09 制热设定温度(B) */
    {   16 ,                26,         30,                 UINT_C,          }, /* 10 制热设定室温(B) */
    {   0   ,               0  ,  POWER_MODE_MAX-1,         UINT_0,          }, /* 10 功率模式 */
    {   0,                  0 ,     SILENT_MAX-1,           UINT_0|D_HIDE,   }, /* 11 静音模式 */
    {   0  ,                0   ,       1   ,               UINT_0|D_RNEXCH, }, /* 12 定时杀菌功能 */
    {   60  ,               65  ,       70  ,               UINT_C,          }, /* 13 杀菌温度 */
    {   90  ,               210 ,       300 ,               UINT_M,          }, /* 14 杀菌最大周期 */
    {   5  ,                15 ,        60 ,                UINT_M,          }, /* 15 杀菌高温时间 */
    {   0  ,                0  ,         1  ,               UINT_0|D_HIDE,   }, /* 16 备用 */
    {LOEST_HEAT,            30 ,    HIEST_HEAT+INOUT_DIFF,  UINT_C|D_HIDE,   }, /* 17 备用 */
    {LOEST_COOL-INOUT_DIFF, 17 ,    HIEST_COOL,             UINT_C|D_HIDE,   }, /* 18 备用 */
    {   0  ,                20 ,        23  ,               UINT_H|D_HIDE,   }, /* 19 备用 */
    {   0  ,                0  ,        59  ,               UINT_M|D_HIDE,   }, /* 20 备用 */
    {   0  ,                5  ,        23  ,               UINT_H|D_HIDE,   }, /* 21 备用 */
    {   0  ,                0  ,        59  ,               UINT_M|D_HIDE,   }, /* 22 备用 */
    {   0 ,                 1 ,         1  ,                UINT_0|D_HIDE,   }, /* 24 锁屏功能设置 */
    {   0 ,                 2,      ALARM_SOUND_SET_MAX-1,  UINT_0|D_HIDE,   }, /* 25 报警音设置 */
    {   0,                  0 ,     TEMP_CURVE_MAX-1,       UINT_0,          }, /* 25 A区制冷曲线 */
    {   0 ,                 0,      TEMP_CURVE_MAX-1,       UINT_0,          }, /* 26 A区制热曲线 */
    {   0 ,                 0,     TEMP_CURVE_MAX-1,        UINT_0,          }, /* 27 B区制冷曲线 */
    {   0 ,                 0,     TEMP_CURVE_MAX-1,        UINT_0,          }, /* 28 B区制热曲线 */
    {   -5,                35,         46 ,                 UINT_C,          }, /* 29 曲线9制冷环温1 */
    {   -5,                25,         46 ,                 UINT_C,          }, /* 30 曲线9制冷环温2 */
    {   5,                 10,         25 ,                 UINT_C,          }, /* 31 曲线9制冷出温1 */
    {   5,                 16,         25 ,                 UINT_C,          }, /* 32 曲线9制冷出温2 */
    {   -25,               7,          35 ,                 UINT_C,          }, /* 33 曲线9制热环温1 */
    {   -25,               -5,         35 ,                 UINT_C,          }, /* 34 曲线9制热环温2 */
    {   25,                28,         65 ,                 UINT_C,          }, /* 35 曲线9制热出温1 */
    {   25,                35,         65 ,                 UINT_C,          }, /* 36 曲线9制热出温2 */
    {   0  ,               1 ,         1,                   UINT_0,          }, /* 37 00#模块设置 */
    {   0  ,               1 ,         1,                   UINT_0,          }, /* 38 01#模块设置 */
    {   0  ,               1 ,         1,                   UINT_0,          }, /* 39 02#模块设置 */
    {   0  ,               1 ,         1,                   UINT_0,          }, /* 40 03#模块设置 */
    {   0  ,               1 ,         1,                   UINT_0,          }, /* 41 04#模块设置 */
    {   0  ,               1 ,         1,                   UINT_0,          }, /* 42 05#模块设置 */
    {   0  ,               1 ,         1,                   UINT_0,          }, /* 43 06#模块设置 */
    {   0  ,               1 ,         1,                   UINT_0,          }, /* 44 07#模块设置 */
};
/* ================================================================================================= */
const PARAM para_item_02[] = /* 2系统参数 */
{
    {   0   ,   1   ,      MAC_TP_MAX-1 ,       D_FAC |UINT_0|D_RNEXCH,     },  /*  0 机组类型 */
    {   0   ,   3   ,        RF_MAX-1,          D_FAC |UINT_0    ,          },  /*  1 冷媒类型 */
    {   0   ,   1   ,    VALVE_TYPE_MAX-1,      D_FAC |UINT_0    ,          },  /*  2 四通阀设置 */
    {   0   ,   0   ,       MAC_MAX-1,          D_PRO |UINT_0|D_HIDE,       },  /*  3 机器型号 para_fac */
    {   0   ,   0   ,           1  ,            D_PRO |UINT_0    ,          },  /*  4 线控开关类型 0=拨动开关  1=脉冲开关 */
    {   0   ,   0   ,           4  ,            D_PRO |UINT_0|D_HIDE,       },  /*  5 机组启停控制 请参见机组启停控制 */
    {   0   ,   0   ,           1  ,            D_PRO |UINT_0    ,          },  /*  6 掉电记忆开关机   0=禁用  1=使用 */
    {   0   ,   0   ,           1  ,            D_PRO |UINT_0    ,          },  /*  7 来电自启动   0=禁用  1=使用 */
    {   0   ,   0   ,    PUMP_MODE_MAX-1,       D_PRO |UINT_0,              },  /*  8 水泵运行模式 */
    {   0   ,   1   ,           1  ,            D_PRO |UINT_0|D_HIDE,       },  /*  9 控制对象 0：回水  1：出水 */
    {   -100,   0  ,            100 ,           D_PRO |UINT_C|D_DE|D_DOT1,  },  /* 10 制冷水温补偿 */
    {   -100,   0,              100 ,           D_PRO |UINT_C|D_DE|D_DOT1,  },  /* 11 制热水温补偿 */
    { -100 ,    20,             100 ,           D_PRO |UINT_S,              },  /* 12 四通阀开延时 */
    { -100 ,    -60 ,           100 ,           D_PRO |UINT_S,              },  /* 13 四通阀关延时 */
    {   0   ,   107 ,           130 ,           D_PRO |UINT_C    ,          },  /* 14 开喷液阀排温 */
    {   0   ,   10  ,           30  ,           D_PRO |UINT_C|D_DE,         },  /* 15 关喷液阀排温差 */
    {   0,      0 ,             1,              D_PRO |UINT_0|D_RNEXCH,     },  /* 16 热水功能 */
    {   -200,   50  ,           200 ,           D_PRO |UINT_C|D_DE|D_DOT1 , },  /* 17 热水回差 */
    {   -10 ,   5   ,           20  ,           D_PRO |UINT_C    ,          },  /* 18 开曲轴环温 */
    {   -10 ,   7   ,           20  ,           D_PRO |UINT_C    ,          },  /* 19 关曲轴环温 */
    {   0   ,   1   ,           1  ,            D_PRO |UINT_0|D_RNEXCH,     },  /* 20 制冷模式 */
    {   0   ,   1   ,           1  ,            D_PRO |UINT_0|D_RNEXCH,     },  /* 21 制热模式 */
    {   0  ,    4 ,             48 ,            D_PRO |UINT_H|D_RNEXCH,     },  /* 22 最小预热掉电(时) */
    {   0  ,    48,             96 ,            D_PRO |UINT_H|D_RNEXCH,     },  /* 23 最大预热掉电(时) */
    {   0  ,    10 ,            999 ,           D_PRO |UINT_M|D_RNEXCH,     },  /* 24 最小预热时间(分) */
    {   0  ,    60 ,            999 ,           D_PRO |UINT_M|D_RNEXCH,     },  /* 25 最大预热时间(分) */
    {   0,      1,              1,              D_FAC |UINT_0,              },  /* 26 热水模式优先 */
    {   0,      0,              1,              D_FAC |UINT_0,              },  /* 27 水箱电热 */
    {   0,      0,              1,              D_FAC |UINT_0,              },  /* 28 下回水泵 */
    {   0,      0,              1,              D_FAC |UINT_0,              },  /* 29 太阳能 */
    {   0,      REMOTE_ONOFF,   REMOTE_MAX-1,   D_PRO |UINT_0|D_RNEXCH,     },  /* 30 联动功能设置 */
    {   0   ,   1   ,           1   ,           D_FAC |UINT_0,              },  /* 31 变频器使用设置   0=禁用  1=使用 */
    {   0  ,       1,           1,              D_FAC |UINT_0|D_HIDE,       },  /* 32 系统变频水泵 */
    {   0,      0,              3 ,             D_FAC |UINT_0|D_RNEXCH,     },  /* 33 温控器控制 */
    {   0  ,    0 ,             3,              D_PRO |UINT_0|D_RNEXCH,     },  /* 34 线控器控制 */
    {   0,      0 ,             10,             D_FAC |UINT_C|D_DE,         },  /* 35 负载修正幅度 */
    {   0,      30,             120,            D_FAC |UINT_M,              },  /* 36 负载修正时间 */
    {   0,      0,      HEATER_MODE_MAX-1,      D_PRO |UINT_0,              },  /* 37 底盘电热模式 */
    {   -50,    5,              50,             D_FAC |UINT_C,              },  /* 38 底盘电热环温 */
    {   0,      0,              9999,           D_PRO |UINT_0,              },  /* 39 启动页类型 */
    {   0,      1,              SG_CFG_MAX-1,   D_PRO |UINT_0,              },  /* 40 智能电网配置 */
    {   0 ,     0,              1,              D_PRO |UINT_0,              },  /* 41 智能电网功能 */
    {   0 ,     100,            200,            D_PRO |D_DOT2|D_HIDE,       },  /* 42 冷热调整系数 */
    {   5   ,   10   ,          999 ,           D_PRO |UINT_M,              },  /* 43 水泵间歇停时长 */
 };
/* ================================================================================================= */
const PARAM para_item_03[] = /* 3压机设置 */
{
    {   0   ,   87  ,   INVT_MODEL_MAX-1,   D_FAC |UINT_0|D_RNEXCH,          }, /*  0 变频压机编码 */
    {   0   ,   0   ,       01  ,           D_FAC |UINT_0    ,               }, /*  1 手动模式 */
    {   0   ,   60  ,       300 ,           D_FAC |UINT_RS   ,               }, /*  2 手动设定转速 */
    {   0   ,   360 ,       800 ,           D_FAC |UINT_S    ,               }, /*  3 防频繁启动 */
    {   0   ,   5   ,       20  ,           D_PRO |UINT_RS   ,               }, /*  4 到温预降频 */
    {   0   ,   30  ,       50  ,           D_FAC |UINT_RS|D_RNEXCH,         }, /*  5 驱动转速下限 */
    {   10  ,   100 ,       300 ,           D_FAC |UINT_RS|D_RNEXCH,         }, /*  6 驱动转速上限 */
    {   35  ,   60  ,       80  ,           D_FAC |UINT_RS   ,               }, /*  7 制冷额定转速 */
    {   35  ,   60  ,       80  ,           D_FAC |UINT_RS   ,               }, /*  8 制热额定转速 */
    {   60  ,   200 ,       900 ,           D_FAC |UINT_S    ,               }, /*  9 启动维持时间 */
    {   -100,   -20 ,       100 ,           D_FAC |UINT_PR|D_DOT1,           }, /* 10 高压限加偏差 */
    {   -100,   4   ,       100 ,           D_FAC |UINT_PR|D_DOT1,           }, /* 11 低压限加偏差 */
    {   -100,   -10 ,       100 ,           D_FAC |UINT_PR|D_DOT1,           }, /* 12 高压强卸偏差 */
    {   -100,   2   ,       100 ,           D_FAC |UINT_PR|D_DOT1,           }, /* 13 低压强卸偏差 */
    {   15  ,   120 ,       500 ,           D_FAC |UINT_M    ,               }, /* 14 低频运行最长时间 */
    {   60  ,   300 ,       500 ,           D_FAC |UINT_S    ,               }, /* 15 强制回油时间 */
    {   1   ,   1   ,       4   ,           D_FAC |UINT_0    ,               }, /* 16 变频驱动地址 */
    {   40  ,   70  ,       100 ,           D_FAC |UINT_RS   ,               }, /* 17 压机除霜转速 */
    {   10,     40  ,       120,            D_FAC |UINT_RS|D_RNEXCH,         }, /* 18 压机启动转速 */
    {   1,      3   ,         60 ,            D_FAC |UINT_RS,                }, /* 19 启动升频速率 */
    {   1,      5   ,         60 ,            D_FAC |UINT_RS,                }, /* 20 运行升频速率 */
    {   1,      3   ,         60 ,            D_FAC |UINT_RS,                }, /* 21 除霜升频速率 */
    {   -30 ,   -3  ,      30  ,           D_FAC |UINT_RS   ,                }, /* 22 标准频率调整 */
    {   1   ,   10  ,       200 ,           D_FAC |UINT_S,                   }, /* 23 启动升频间隔 */
    {   1   ,   600 ,       9000,           D_FAC |UINT_0    ,               }, /* 24 调频比例带 */
    {   0   ,   50  ,       999 ,           D_FAC |UINT_0    ,               }, /* 25 调频积分时间 */
    {   0   ,   10  ,       999 ,           D_FAC |UINT_0    ,               }, /* 26 调频微分时间 */
    {   3   ,   30  ,       999 ,           D_FAC |UINT_S    ,               }, /* 27 调频动作周期 */
    {   10,     40  ,       120 ,           D_FAC |UINT_RS|D_RNEXCH,         }, /* 28 压机启动维持转速 */
    {   1   ,   10  ,       999 ,           D_FAC |D_DOT1    ,               }, /* 29 调频比例系数 */
    {   30  ,   63  ,       120 ,           D_FAC |UINT_C    ,               }, /* 30 制冷冷凝上限 */
    {   30  ,   63  ,       120 ,           D_FAC |UINT_C    ,               }, /* 31 制热冷凝上限 */
    {   -30 ,   -8  ,       30  ,           D_FAC |UINT_RS   ,               }, /* 32 节能频率调整 */
    {   -50 ,   -42 ,       50  ,           D_FAC |UINT_C    ,               }, /* 33 制热蒸发下限 */
    {   0   ,   60  ,       900 ,           D_PRO |UINT_S    ,               }, /* 34 额定维持时间 */
    {   0,      25,         99  ,           D_FAC |UINT_C|D_HIDE,            }, /* 35 制冷回油环温 */
    {   0,      15,         99  ,           D_FAC |UINT_C|D_HIDE,            }, /* 36 制热回油环温 */
    {   80  ,   105 ,       150 ,           D_FAC |UINT_C    ,               }, /* 37 强制降频排温 */
    {   30  ,   50  ,       100 ,           D_FAC |UINT_RS   ,               }, /* 38 回油运行频率 */
    {   40,     50,         100,            D_FAC |UINT_RS,                  }, /* 39 超静音最大转速 */
    {   -30 ,   0   ,       30  ,           D_FAC |UINT_RS   ,               }, /* 40 强劲频率调整 */
    {   40,     70,         100,            D_FAC |UINT_RS,                  }, /* 41 静音最大转速 */
    {   0   ,   0   ,       10  ,           D_FAC |UINT_RS   ,               }, /* 42 回避频率范围 */
    {   0   ,   20  ,       120 ,           D_FAC |UINT_RS   ,               }, /* 43 回避频率1 */
    {   0   ,   20  ,       120 ,           D_FAC |UINT_RS   ,               }, /* 44 回避频率2 */
    {   0   ,   20  ,       120 ,           D_FAC |UINT_RS   ,               }, /* 45 回避频率3 */
    {   0   ,   20  ,       120 ,           D_FAC |UINT_RS   ,               }, /* 46 回避频率4 */
    {   10,     40  ,       120 ,           D_FAC |UINT_RS|D_RNEXCH,         }, /* 47 低环启动维持转速 */
};
/* ================================================================================================= */
const PARAM para_item_04[] = /* 4风机设置 */
{
    {   0   ,   2   ,   FREQ_FAN_SET_MAX-1,     D_FAC |UINT_0,          },  /*  0 变频风机设置 */
    {   0   ,   57  ,   INVT_MODEL_FAN_MAX-1,   D_PRO |UINT_0    ,      },  /*  1 EC风机编码 */
    {   0   ,   900 ,   FAN_FREQ_MAX,           D_FAC |UINT_RM   ,      },  /*  2 制冷风机最高 */
    {   0   ,   350 ,   FAN_FREQ_MAX,           D_FAC |UINT_RM   ,      },  /*  3 制冷风机最低 */
    {   0   ,   100 ,   200 ,                   D_FAC |D_DOT2,          },  /*  4 节能风速调整 */
    {   0,      2,      FREQ_FAN_CTRL_MAX-1,    D_FAC |UINT_0,          },  /*  5 变频风机调速 */
    {   0,      0,      FAN_FREQ_MAX,           D_FAC |UINT_RM,         },  /*  6 风机手动运行 */
    {   60,     80,     150,                    D_FAC |UINT_C,          },  /*  7 高风模块温度 */
    {   -30 ,   32,     60  ,                   D_FAC |UINT_C,          },  /*  8 制冷高风环温 */
    {   -30 ,   20,     60  ,                   D_FAC |UINT_C,          },  /*  9 制冷低风环温 */
    {   -30 ,   10,     60  ,                   D_FAC |UINT_C,          },  /* 10 制热高风环温 */
    {   -30 ,   20,     60  ,                   D_FAC |UINT_C,          },  /* 11 制热低风环温 */
    {   -30 ,   40,     60  ,                   D_FAC |UINT_C,          },  /* 12 制冷高风冷凝 */
    {   -30 ,   25,     60  ,                   D_FAC |UINT_C,          },  /* 13 制冷低风冷凝 */
    {   -30 ,   1 ,     60  ,                   D_FAC |UINT_C,          },  /* 14 制热高风蒸发 */
    {   -30 ,   18 ,    60  ,                   D_FAC |UINT_C,          },  /* 15 制热低风蒸发 */
    {   -30 ,   8 ,     60  ,                   D_FAC |UINT_C,          },  /* 16 制热中风温度 */
    {   0  ,    30 ,    100 ,                   D_FAC |UINT_S,          },  /* 17 风速调节周期 */
    {   0  ,    10 ,    100,                    D_FAC |UINT_PE,         },  /* 18 风速动作比例 */
    {   0   ,   900 ,   FAN_FREQ_MAX,           D_FAC |UINT_RM   ,      },  /* 19 制热风机最高 */
    {   0   ,   350 ,   FAN_FREQ_MAX,           D_FAC |UINT_RM   ,      },  /* 20 制热风机最低 */
    {   0  ,    12 ,    100,                    D_FAC |UINT_0,          },  /* 21 PWM风机脉冲 */
    {   0   ,   106 ,   200 ,                   D_FAC |D_DOT2,          },  /* 22 强劲风速调整 */
    {    1 ,    11,     247,                    D_FAC |UINT_0,          },  /* 23 EC风机基址 */
    {   -30 ,   30,     60  ,                   D_FAC |UINT_C,          },  /* 24 制冷中风温度 */
    {   500 ,   700 ,   900,                    D_FAC |UINT_RM,         },  /* 25 超静音最大风速 */
    {   1,      1,      2,                      D_FAC |UINT_0,          },  /* 26 变频风机个数 */
    {   500 ,   800 ,   900,                    D_FAC |UINT_RM,         },  /* 27 静音最大风速 */
    {   0,      20,     100,                    D_FAC |UINT_PE,         },  /* 28 pwm调速初始值 */
    {   1,      20,     999,                    D_FAC |UINT_PE,         },  /* 29 pwm调速系数 */
    {   1,      18,      20,                    D_FAC |UINT_S,          },  /* 30 pwm调速间隔 */
    {   1,      2,      10,                     D_FAC |UINT_0,          },  /* 31 pwm调速死区 */
    {   0   ,   100 ,   200 ,                   D_FAC |D_DOT2,          },  /* 32 标准风速调整 */
    {   0  ,    1  ,    1  ,                    D_FAC |UINT_0,          },  /* 33 防冷风功能 */
    {   0  ,    0,      240  ,                  D_FAC |UINT_S,          },  /* 34 送风机暂停 */
    {   0  ,    5  ,    60  ,                   D_FAC |UINT_S,          },  /* 35 防冷风时间 */
    {   1,      40,     300,                    D_FAC |UINT_PE,         },  /* 36 频率补偿系数 */
    {   1,      70,     100,                    D_FAC |UINT_PE,         },  /* 37 修正系数下限 */
    {   0   ,   106 ,   200 ,                   D_FAC |D_DOT2,          },  /* 38 排温风速修正1 */
    {   0   ,   100 ,   200 ,                   D_FAC |D_DOT2,          },  /* 39 排温风速修正2 */
    {   0   ,   90,     200 ,                   D_FAC |D_DOT2,          },  /* 40 排温风速修正3 */
    {   0   ,   2 ,     FAN_TP_CORR_MAX-1,      UINT_0|D_FAC,           },  /* 41 排温修正设置 */
    {   0 ,     0,      9999,                   D_FAC |UINT_C|D_DE,     },  /* 42 制冷停风温差 */
    {   0 ,     0,      9999,                   D_FAC |UINT_C|D_DE,     },  /* 43 制热停风温差 */
    {   0 ,     5,      60  ,                   D_FAC |UINT_C|D_DE,     },  /* 44 停风回差 */
    {   0   ,   0 ,     FAN_FREQ_MAX,           D_FAC |UINT_RM   ,      },  /* 45 制冷风机中速 */
    {   0   ,   0 ,     FAN_FREQ_MAX,           D_FAC |UINT_RM   ,      },  /* 46 制冷风机中速 */
};
/* ================================================================================================= */
const PARAM para_item_05[] = /* 5电膨设置 */
{
    {   0,          1,  EEV_CTRL_MAX-1,     D_FAC |UINT_0|D_RNEXCH|D_HIDE,  },  /*  0 主阀使用设置 */
    {   0,          0,      1,              D_FAC |UINT_0|D_RNEXCH,         },  /*  1 主阀励磁方式 */
    {   0,          0,      6,              D_FAC |UINT_0|D_RNEXCH,         },  /*  2 主阀励磁频率 */
    {   20,         480,    9000,           D_FAC |UINT_ST|D_RNEXCH,        },  /*  3 主阀总步数 */
    {   0,          68  ,   200,            D_FAC |UINT_PE|D_DOT1,          },  /*  4 主强动作比例 */
    {   0 ,         100,    100,            D_FAC |UINT_PE,                 },  /*  5 主阀最大开度 */
    {   -100,       0   ,   300 ,           D_FAC |UINT_C|D_DE|D_DOT1,      },  /*  6 主阀过热排温补 */
    {   0,          0,      1,              D_FAC |UINT_0,                  },  /*  7 主阀手动模式 */
    {   0,          250,    9000,           D_FAC |UINT_ST,                 },  /*  8 主阀手动步数 */
    {   -100,       0   ,   300 ,           D_FAC |UINT_C|D_DE|D_DOT1,      },  /*  9 主阀过热频率补 */
    {   0,          2,  EVI_CTRL_MAX-1,     D_FAC |UINT_0|D_RNEXCH,         },  /* 10 辅阀使用设置 */
    {   0,          0,      1,              D_FAC |UINT_0|D_RNEXCH,         },  /* 11 辅阀励磁方式 */
    {   0,          0,      6,              D_FAC |UINT_0|D_RNEXCH,         },  /* 12 辅阀励磁频率 */
    {   20,         480,    9000,           D_FAC |UINT_ST|D_RNEXCH,        },  /* 13 辅阀总步数 */
    {   0,          60  ,   200,            D_FAC |UINT_PE|D_DOT1,          },  /* 13 辅强动作比例 */
    {   0 ,         100,    100,            D_FAC |UINT_PE,                 },  /* 15 辅阀最大开度 */
    {   0,          120,    1000,           D_FAC |UINT_PE|D_DOT1,          },  /* 16 辅阀最小开度 */
    {   0,          0,      1,              D_FAC |UINT_0,                  },  /* 17 辅阀手动模式 */
    {   0,          250,    9000,           D_FAC |UINT_ST,                 },  /* 18 辅阀手动步数 */
    {   0,          42 ,    100,            D_FAC |UINT_C,                  },  /* 19 低环高水回温 */
    { -100,         -30,    100,            D_FAC |UINT_C,                  },  /* 20 低环高水环温 */
    {   0,          350 ,   500,            D_FAC |UINT_ST,                 },  /* 21 低环高水主阀 */
    {   0,           0,     500,            D_FAC |UINT_ST,                 },  /* 22 主阀参考开度 */
    {   1,           5,     20,             D_FAC |UINT_0,                  },  /* 23 参考开度系数 */
    {   -30 ,       20  ,   100 ,           D_FAC |UINT_C    ,              },  /* 24 制冷过热转换环 */
    {   -30 ,       40  ,   800 ,           D_FAC |D_DOT1|UINT_C|D_DE,      },  /* 25 低环制冷过热1 */
    {   -30 ,       40  ,   800 ,           D_FAC |D_DOT1|UINT_C|D_DE,      },  /* 26 低环制冷过热2 */
    {   -30 ,       50  ,   800 ,           D_FAC |D_DOT1|UINT_C|D_DE,      },  /* 27 低环制冷过热3 */
    {   0,          4,      30,             UINT_RS|D_FAC,                  },  /* 28 主阀变频增量 */
    {   0,           0,     100,            D_DOT1|D_FAC,                   },  /* 29 主阀升频系数 */
    {   0,           0,     100,            D_DOT1|D_FAC,                   },  /* 30 主阀降频系数 */
    { -100,         38,     100,            D_FAC |UINT_C,                  },  /* 31 制冷初开趋势环 */
    { -100,         20  ,   300 ,           D_FAC |UINT_C|D_DE|D_DOT1,      },  /* 32 制热吸气过热10 */
    {  0,      EVI_PRIOR,   EEV_EVI_MAX-1,  D_FAC |UINT_0|D_HIDE,           },  /* 33 高排温主辅次序 */
};
/* ================================================================================================= */
const PARAM para_item_06[] = /* 6主阀设置 */
{
    {   0   ,   70  ,   100 ,       D_FAC |UINT_PE,                 },  /*  0 待机开度 */
    {   0   ,   180  ,  300 ,       D_FAC |UINT_S    ,              },  /*  1 初开维持时间 */
    {   3   ,   10  ,   80  ,       D_FAC |D_DOT1    ,              },  /*  2 制冷初开放大 */
    {   3   ,   10  ,   80  ,       D_FAC |D_DOT1    ,              },  /*  3 制热初开放大1 */
    {   3   ,   10  ,   80  ,       D_FAC |D_DOT1    ,              },  /*  4 制热初开放大2 */
    {   3   ,   12  ,   80  ,       D_FAC |D_DOT1    ,              },  /*  5 制热初开放大3 */
    {   -30 ,   25  ,   100 ,       D_FAC |UINT_C    ,              },  /*  6 制热初开转换1 */
    {   -30 ,   45  ,   100 ,       D_FAC |UINT_C    ,              },  /*  7 制热初开转换2 */
    {   10  ,   45  ,   100 ,       D_FAC |UINT_PE   ,              },  /*  8 制冷初开下限 */
    {   10  ,   85  ,   100 ,       D_FAC |UINT_PE   ,              },  /*  9 制冷初开上限 */
    {   10  ,   40  ,   100 ,       D_FAC |UINT_PE   ,              },  /* 10 制热初开下限 */
    {   10  ,   68  ,   100 ,       D_FAC |UINT_PE   ,              },  /* 11 制热初开上限 */
    {   10  ,   10  ,   30  ,       D_FAC |UINT_0|D_DOT1    ,       },  /* 12 关辅初开放大 */
    {   -30 ,   30  ,   800 ,       D_FAC |D_DOT1|UINT_C|D_DE,      },  /* 13 制冷吸气过热1 */
    {   -30 ,   30  ,   800 ,       D_FAC |D_DOT1|UINT_C|D_DE,      },  /* 14 制冷吸气过热2 */
    {   -30 ,   30  ,   800 ,       D_FAC |D_DOT1|UINT_C|D_DE,      },  /* 15 制冷吸气过热3 */
    {   -30 ,   25  ,   100 ,       D_FAC |UINT_C    ,              },  /* 16 制冷过热转换1 */
    {   -30 ,   15  ,   100 ,       D_FAC |UINT_C    ,              },  /* 17 制冷过热转换2 */
    {   -100,   20  ,   300 ,       D_FAC |UINT_C|D_DE|D_DOT1,      },  /* 18 制热吸气过热1 */
    {   -100,   20  ,   300 ,       D_FAC |UINT_C|D_DE|D_DOT1,      },  /* 19 制热吸气过热2 */
    {   -100,   20  ,   300 ,       D_FAC |UINT_C|D_DE|D_DOT1,      },  /* 20 制热吸气过热3 */
    {   -100,   20  ,   300 ,       D_FAC |UINT_C|D_DE|D_DOT1,      },  /* 21 制热吸气过热4 */
    {   -100,   20  ,   300 ,       D_FAC |UINT_C|D_DE|D_DOT1,      },  /* 22 制热吸气过热5 */
    {   -100,   20  ,   300 ,       D_FAC |UINT_C|D_DE|D_DOT1,      },  /* 23 制热吸气过热6 */
    {   -100,   20  ,   300 ,       D_FAC |UINT_C|D_DE|D_DOT1,      },  /* 24 制热吸气过热7 */
    {   -100,   20  ,   300 ,       D_FAC |UINT_C|D_DE|D_DOT1,      },  /* 25 制热吸气过热8 */
    {   -100,   20  ,   300 ,       D_FAC |UINT_C|D_DE|D_DOT1,      },  /* 26 制热吸气过热9 */
    {   5   ,   27  ,   9999,       D_FAC |UINT_C,                  },  /* 27 强关小蒸发上限 */
    {   40  ,   85  ,   100 ,       D_FAC |UINT_PE   ,              },  /* 28 除霜开度 */
    {   0   ,   3   ,   10  ,       D_FAC |UINT_PE,                 },  /* 29 主阀动作限幅 */
    {   1   ,   1250,   9999,       D_FAC |UINT_0    ,              },  /* 30 比例带 */
    {   0   ,   200 ,   9999,       D_FAC |UINT_0    ,              },  /* 31 积分时间 */
    {   0   ,   10  ,   999 ,       D_FAC |UINT_0    ,              },  /* 32 微分时间 */
    {   3   ,   10  ,   999 ,       D_FAC |UINT_S    ,              },  /* 33 pid动作周期 */
    {   1   ,   8   ,   1000,       D_FAC |D_DOT1|UINT_S|D_HIDE,    },  /* 34 pid计算周期 */
    {   1   ,   2   ,   999 ,       D_FAC |D_DOT1    ,              },  /* 35 比例系数 */
    {   0   ,   20  ,   100 ,       D_FAC |UINT_PE   ,              },  /* 36 制热最小开度1 */
    {   0   ,   18  ,   100 ,       D_FAC |UINT_PE   ,              },  /* 37 制热最小开度2 */
    {   0   ,   16  ,   100 ,       D_FAC |UINT_PE   ,              },  /* 38 制热最小开度3 */
    {   0   ,   14  ,   100 ,       D_FAC |UINT_PE   ,              },  /* 39 制热最小开度4 */
    {   0   ,   16  ,   100 ,       D_FAC |UINT_PE   ,              },  /* 40 制热最小开度5 */
    {   0   ,   20  ,   100 ,       D_FAC |UINT_PE   ,              },  /* 41 制冷最小开度1 */
    {   0   ,   18  ,   100 ,       D_FAC |UINT_PE   ,              },  /* 42 制冷最小开度2 */
    {   0   ,   16  ,   100 ,       D_FAC |UINT_PE   ,              },  /* 43 制冷最小开度3 */
    {   0   ,   14  ,   100 ,       D_FAC |UINT_PE   ,              },  /* 44 制冷最小开度4 */
    {   0   ,   12  ,   100 ,       D_FAC |UINT_PE   ,              },  /* 45 制冷最小开度5 */
    {   -50 ,   -40 ,   50  ,       D_FAC |UINT_C    ,              },  /* 46 制热限关翅温 */
    {   -50 ,   0   ,   100 ,       D_FAC |UINT_ST   ,              },  /* 47 除霜初开补偿 */
};
/* ================================================================================================= */
const PARAM para_item_07[] = /* 7辅阀设置 */
{
    {   0   ,   1   ,   1   ,   D_FAC |UINT_0    ,              },//  0 经济器制热开启
    {   0   ,   0   ,   1   ,   D_FAC |UINT_0    ,              },//  1 经济器制冷开启
    {   0   ,   30  ,   999 ,   D_FAC |UINT_S    ,              },//  2 辅阀开机延时
    { -30   ,   12  ,   150 ,   D_FAC |UINT_C,                  },//  3 制热开阀环温
    {   0   ,   30  ,   150 ,   D_FAC |UINT_C,                  },//  4 辅阀开启排温
    { -30   ,   25  ,   150 ,   D_FAC |UINT_C,                  },//  5 制冷开阀环温
    {   0   ,   3   ,   10  ,   D_FAC |UINT_C|D_DE|D_HIDE,      },//  6 辅阀过热度偏差
    {   0   ,   20  ,   100 ,   D_FAC |UINT_PE   ,              },//  7 制冷初始开度
    {   0   ,   12  ,   100 ,   D_FAC |UINT_PE   ,              },//  8 制热初始开度 1  当环温≥-10℃使用
    {   0   ,   15  ,   100 ,   D_FAC |UINT_PE   ,              },//  9 制热初始开度 2  -15℃＜环温＜-10℃
    {   0   ,   20  ,   100 ,   D_FAC |UINT_PE   ,              },// 10 制热初始开度 3  -20℃＜环温≤-15℃
    {   0   ,   25  ,   100 ,   D_FAC |UINT_PE   ,              },// 11 制热初始开度 4  环温≤-20℃
    {   0   ,   15  ,   50  ,   D_FAC |UINT_C|D_DE    ,         },// 12 制冷开启排过
    {   0   ,   15  ,   50  ,   D_FAC |UINT_C|D_DE    ,         },// 13 制热开启排过
    {   1   ,   8   ,   200 ,   D_FAC |UINT_S|D_HIDE,           },// 14 备用
    {   1   ,   1000,   9999,   D_FAC |UINT_0    ,              },// 15 比例带
    {   0   ,   300 ,   9999,   D_FAC |UINT_0    ,              },// 16 积分时间
    {   0   ,   10  ,   999 ,   D_FAC |UINT_0    ,              },// 17 微分时间
    {   3   ,   8   ,   999 ,   D_FAC |UINT_S    ,              },// 18 pid动作周期
    {   1   ,   8   ,   100 ,   D_FAC |UINT_S|D_DOT1|D_HIDE,    },// 19 pid计算周期
    {   1   ,   10  ,   999 ,   D_FAC |D_DOT1    ,              },// 20 比例系数
    {   0   ,   10  ,   999 ,   D_FAC |D_DOT1|D_HIDE,           },// 21 积分系数
    {   60  ,   75  ,   130 ,   D_FAC |UINT_C    ,              },// 22 过热度转换1
    {   60  ,   90  ,   130 ,   D_FAC |UINT_C    ,              },// 23 过热度转换2
    {   -50 ,   60  ,   600 ,   D_FAC |D_DOT1|UINT_C|D_DE,      },// 24 过热度设定1 【辅阀使用设置】=“辅路-经济器”时目标过热度1
    {   -50 ,   10  ,   600 ,   D_FAC |D_DOT1|UINT_C|D_DE,      },// 25 过热度设定2 【辅阀使用设置】=“辅路-经济器”时目标过热度2
    {   95  ,   105 ,   150 ,   D_FAC |UINT_C,                  },// 26 最高目标排温
    {   0   ,   35  ,   80  ,   D_FAC |UINT_C|D_DE    ,         },// 27 制冷排气过热
    {  -100 ,   1 ,     100 ,   D_FAC |UINT_0|D_DOT1,           },/* 28 排过水温系数 */
    {   0   ,   260 ,   1000,   D_FAC |UINT_C|D_DE|D_DOT1,      },/* 29 制热排气过热1 */
    {   0   ,   280 ,   1000,   D_FAC |UINT_C|D_DE|D_DOT1,      },/* 30 制热排气过热2 */
    {   0   ,   310 ,   1000,   D_FAC |UINT_C|D_DE|D_DOT1,      },/* 31 制热排气过热3 */
    {   0   ,   340 ,   1000,   D_FAC |UINT_C|D_DE|D_DOT1,      },/* 32 制热排气过热4 */
    {   0   ,   360 ,   1000,   D_FAC |UINT_C|D_DE|D_DOT1,      },/* 33 制热排气过热5 */
    {   5,      45  ,   120,    D_FAC |UINT_RS,                 },// 34 辅阀开启转速
    {   5,      40,     120,    D_FAC |UINT_RS,                 },// 35 辅阀关闭转速
    {   0   ,   60  ,   100 ,   D_FAC |UINT_C|D_DE,             },// 36 辅阀开排过偏差
    {   0   ,   60  ,   100 ,   D_FAC |UINT_C|D_DE,             },// 37 辅阀开排温偏差
    {   0 ,     0  ,    1,      D_FAC |UINT_0,                  },/* 38 辅阀当喷液阀 */
    {   -200,   1000,   1500,   D_FAC |UINT_0|D_HIDE,           },/* 39 制热辅阀控制A */
    {   -200,   1000,   1500,   D_FAC |UINT_0|D_HIDE,           },/* 40 制热辅阀控制B */
    {   -200,   1000,   1500,   D_FAC |UINT_0|D_HIDE,           },/* 41 制热辅阀控制E */
    {   -200,   1000,   1500,   D_FAC |UINT_0|D_HIDE,           },/* 42 制热辅阀控制G */
    {   -200,   1000,   1500,   D_FAC |UINT_0|D_HIDE,           },/* 43 制热辅阀控制C */
    {   -200,   1000,   1500,   D_FAC |UINT_0|D_HIDE,           },/* 44 制热辅阀控制D */
    {   -200,   1000,   1500,   D_FAC |UINT_0|D_HIDE,           },/* 45 制冷辅阀控制  */
};
/* ================================================================================================= */
const PARAM para_item_08[] = /* 8除霜设置 */
{
    {   0   ,   5   ,   255 ,           D_FAC |UINT_M    ,      },  /*  0 首次除霜间隔 */
    {   90  ,   380 ,   1200,           D_FAC |UINT_S    ,      },  /*  1 除霜时间 */
    {   0   ,   1   ,   1   ,           D_FAC |UINT_0    ,      },  /*  2 积霜计时选择 */
    {   0   ,   12  ,   30  ,           D_FAC |UINT_C    ,      },  /*  3 允许除霜环温 */
    {   -20 ,   -1  ,   10  ,           D_FAC |UINT_C    ,      },  /*  4 允许除霜翅温 */
    {   0   ,   15  ,   30  ,           D_FAC |UINT_C    ,      },  /*  5 退除霜翅温 */
    {   0   ,   6   ,   60  ,           D_FAC |UINT_C    ,      },  /*  6 退除霜出水温度 */
    {   0 ,     1  ,    1,              D_FAC |UINT_0,          },  /*  7 环翅智能除霜 */
    {  -30  ,   4 ,     30 ,            D_FAC |UINT_C|D_DE,     },  /*  8 中度结霜温差 */
    {  -30 ,    6 ,     30 ,            D_FAC |UINT_C|D_DE,     },  /*  9 重度结霜温差 */
    {  3 ,      5  ,    30  ,           D_FAC |UINT_M,          },  /* 10 温度确认时间 */
    {   -20 ,   8   ,   15  ,           D_FAC |UINT_C    ,      },  /* 11 除霜环温1 */
    {   -20 ,   3   ,   10  ,           D_FAC |UINT_C    ,      },  /* 12 除霜环温2 */
    {   -20 ,   -2  ,   10  ,           D_FAC |UINT_C    ,      },  /* 13 除霜环温3 */
    {   -20 ,   -10 ,   10  ,           D_FAC |UINT_C    ,      },  /* 14 除霜环温4 */
    {   0   ,   90  ,   255 ,           D_FAC |UINT_M    ,      },  /* 15 除霜间隔1 */
    {   0   ,   60  ,   255 ,           D_FAC |UINT_M    ,      },  /* 16 除霜间隔2 */
    {   0   ,   45  ,   255 ,           D_FAC |UINT_M    ,      },  /* 17 除霜间隔3 */
    {   0   ,   60  ,   255 ,           D_FAC |UINT_M    ,      },  /* 18 除霜间隔4 */
    {   0   ,   120 ,   255 ,           D_FAC |UINT_M    ,      },  /* 19 除霜间隔5 */
    {   0   ,   6   ,   20  ,           D_FAC |UINT_C|D_DE,     },  /* 20 除霜环翅差1 */
    {   0   ,   6   ,   20  ,           D_FAC |UINT_C|D_DE,     },  /* 21 除霜环翅差2 */
    {   -10 ,   6   ,   20  ,           D_FAC |UINT_C|D_DE,     },  /* 22 除霜环翅差3 */
    {   -10 ,   6   ,   20  ,           D_FAC |UINT_C|D_DE,     },  /* 23 除霜环翅差4 */
    {   -10 ,   6   ,   20  ,           D_FAC |UINT_C|D_DE,     },  /* 24 除霜环翅差5 */
    {   0   ,   0   ,   1   ,           D_FAC |UINT_0    ,      },  /* 25 低压除霜设置 */
    {   3   ,   5   ,   30  ,           D_FAC |UINT_M    ,      },  /* 26 低压除霜检测延时 */
    {   5   ,   15  ,   60  ,           D_FAC |UINT_M    ,      },  /* 27 低压除霜间隔 */
    {   -20 ,   -8  ,   0   ,           D_FAC |UINT_C    ,      },  /* 28 低压除霜翅温 */
    {  0  ,     3  ,    9  ,            D_FAC |UINT_H,          },  /* 29 定时除霜间隔:最大只能9h */
    {  -30  ,   30 ,    50  ,           D_FAC |UINT_C|D_DE,     },  /* 30 紧急除霜环翅 */
    {   0  ,    0 ,  DF_STOP_CM_MAX-1,  D_FAC |UINT_0,          },  /* 31 除霜停机切阀 */
    {   0 ,     30,     255 ,           D_FAC |UINT_S,          },  /* 32 进除霜压机延时 */
    {   0  ,    10,     120 ,           D_FAC |UINT_S,          },  /* 33 进除霜四通延时 */
    {   0 ,     30,     255 ,           D_FAC |UINT_S,          },  /* 34 退除霜压机延时 */
    {   0  ,    10,     120 ,           D_FAC |UINT_S,          },  /* 35 退除霜四通延时 */
    {   20  ,   40  ,   100 ,           D_FAC |UINT_RS   ,      },  /* 36 除霜切阀频率 */
    {   0  ,    0,      300 ,           D_FAC |UINT_S,          },  /* 37 停风滴水时间 */
    {   0   ,   0   ,   60  ,           D_FAC |UINT_M    ,      },  /* 38 最小除霜间隔 */
    {   0   ,   5   ,   255 ,           D_FAC |UINT_M    ,      },  /* 39 紧急除霜间隔 */
};
/* ================================================================================================= */
const PARAM para_item_09[] = /* 9防冻设置 */
{
    {   0   ,   40  ,   100 ,           D_FAC |UINT_M            ,   },     /*  0 防冻间隔1 */
    {   0   ,   20  ,   100 ,           D_FAC |UINT_M            ,   },     /*  1 防冻间隔2 */
    {   -10 ,   15  ,   20  ,           D_FAC |UINT_C            ,   },     /*  2 水泵防冻温度 */
    {   -10 ,   10  ,   20  ,           D_FAC |UINT_C            ,   },     /*  3 电热防冻温度 */
    {   -10 ,   8   ,   20  ,           D_FAC |UINT_C            ,   },     /*  4 压机防冻温度 */
    {   5   ,   12  ,   20  ,           D_FAC |UINT_C            ,   },     /*  5 电热退防冻温度 */
    {   5   ,   15  ,   40  ,           D_FAC |UINT_C            ,   },     /*  6 压机退防冻温度 */
    {   -10 ,   0   ,   20  ,           D_FAC |UINT_C            ,   },     /*  7 防冻间隔环温 */
    {   -10 ,   4   ,   20  ,           D_FAC |UINT_C            ,   },     /*  8 进防冻环温 */
    {   0   ,   1   ,   10  ,           D_FAC |UINT_C|D_DE       ,   },     /*  9 退防冻环温差 */
    {   0   ,   1   ,   1   ,           D_FAC |UINT_0            ,   },     /* 10 防冻功能设置 */
    {   0   ,   0   ,   1   ,           D_PRO |UINT_0            ,   },     /* 11 太阳能水泵防冻 */
    {   0   ,   40  ,   9999,           D_FAC |UINT_M            ,   },     /* 12 定时防冻间隔 */
    {   3   ,   10  ,   100 ,           D_FAC |UINT_M            ,   },     /* 13 定时防冻时长 */
    {   0   ,   0   ,   1   ,           UINT_0|D_HIDE            ,   },     /* 14 备用 */
    {   0   ,   0   ,   1   ,           UINT_0|D_HIDE            ,   },     /* 15 备用 */
    {   0   ,   0   ,   1   ,           UINT_0|D_HIDE            ,   },     /* 16 备用 */
    {   0   ,   0   ,   1   ,           UINT_0|D_HIDE            ,   },     /* 17 备用 */
    {   0   ,   0   ,   1   ,           UINT_0|D_HIDE            ,   },     /* 18 备用 */
    {   0   ,   0   ,   1   ,           UINT_0|D_HIDE            ,   },     /* 19 备用 */
    {   0   ,   0   ,   1   ,           UINT_0|D_HIDE            ,   },     /* 20 备用 */
    {   0   ,   0   ,   1   ,           UINT_0|D_HIDE            ,   },     /* 21 备用 */
    {   0   ,   0   ,   1   ,           UINT_0|D_HIDE            ,   },     /* 22 备用 */
    {   0   ,   0   ,   1   ,           UINT_0|D_HIDE            ,   },     /* 23 备用 */
    {   0   ,   0   ,   1   ,           UINT_0|D_HIDE            ,   },     /* 24 备用 */
    {   0   ,   0   ,   1   ,           UINT_0|D_HIDE            ,   },     /* 25 备用 */
    {   0   ,   0   ,   1   ,           UINT_0|D_HIDE            ,   },     /* 26 备用 */
    {   0   ,   0   ,   1   ,           UINT_0|D_HIDE            ,   },     /* 27 备用 */
    {   0   ,   0   ,   1   ,           UINT_0|D_HIDE            ,   },     /* 28 备用 */
    {   0   ,   0   ,   1   ,           UINT_0|D_HIDE            ,   },     /* 29 备用 */
    {   0   ,   0   ,   1   ,           UINT_0|D_HIDE            ,   },     /* 30 备用 */
    {   -60 ,   12  ,   60  ,           D_FAC |UINT_C            ,   },     /* 31 制热转换环1 */
    {   -60 ,   3   ,   60  ,           D_FAC |UINT_C            ,   },     /* 32 制热转换环2 */
    {   -60 ,   -3  ,   60  ,           D_FAC |UINT_C            ,   },     /* 33 制热转换环3 */
    {   -60 ,   -13 ,   60  ,           D_FAC |UINT_C            ,   },     /* 34 制热转换环4 */
    {   -60 ,   -24 ,   60  ,           D_FAC |UINT_C            ,   },     /* 35 制热转换环5 */
};
/* ================================================================================================= */
const PARAM para_item_10[] = /* 10保护设置 */
{
    {   0   ,   6   ,   30  ,               D_FAC |UINT_S    ,       }, /*  0 一般故障延时 */
    {   0   ,   15  ,   30  ,               D_FAC |UINT_S    ,       }, /*  1 水流不足检测延时 */
    {   0   ,   3   ,   30  ,               D_FAC |UINT_M    ,       }, /*  2 故障复位时间 */
    {   0   ,   60  ,   360 ,               D_FAC |UINT_M    ,       }, /*  3 自动复位允许时间 */
    {   10  ,   60  ,   600 ,               D_FAC |UINT_S    ,       }, /*  4 低压检测延时 */
    {   0   ,   90  ,   255 ,               D_FAC |UINT_S    ,       }, /*  5 退除霜低压检延 */
    {   1   ,   10  ,   30  ,               D_FAC |UINT_S    ,       }, /*  6 制冷低压消抖延时 */
    {   3   ,   30  ,   120 ,               D_FAC |UINT_S    ,       }, /*  7 制热低压消抖延时 */
    {   1   ,   5   ,   30  ,               D_FAC |UINT_C|D_DE    ,  }, /*  8 退出温保护温差 */
    {   -20 ,   4   ,   30  ,               D_FAC |UINT_C    ,       }, /*  9 制冷出温过低 */
    {   0   ,   64  ,   100 ,               D_FAC |UINT_C    ,       }, /* 10 制热出温过高 */
    {   -50 ,  -10  ,   50  ,               D_FAC |UINT_C|D_HIDE,    }, /* 11 制冷禁开环温 */
    {   0   ,   2   ,   50  ,               D_FAC |UINT_C|D_DE,      }, /* 12 出回温差异常 */
    {   0   ,   60  ,   999 ,               D_FAC |UINT_S,           }, /* 13 吸排异常检延 */
    {   0   ,   0   ,   1   ,               D_FAC |UINT_0    ,       }, /* 14 水流不足开泵 */
    {   0   ,   90  ,   100 ,               D_FAC |UINT_PE,          }, /* 15 强制降频比例 */
    {   5   ,   120 ,   300 ,               D_FAC |UINT_S,           }, /* 16 强制降频周期 */
    {   0   ,   15  ,   50  ,               D_FAC |UINT_C|D_DE,      }, /* 17 出回温差过大 */
    {   -30 ,   -11 ,   50  ,               D_FAC |UINT_C    ,       }, /* 18 制冷蒸发过低 */
    {   80  ,   110 ,   150 ,               D_FAC |UINT_C    ,       }, /* 19 排气温度过高 */
    {   0   ,   15  ,   50  ,               D_FAC |UINT_C|D_DE    ,  }, /* 20 退排温过高温差 */
    {   -30 ,   0   ,   50  ,               D_FAC |UINT_C    ,       }, /* 21 制冷吸气过低 */
    {   0   ,   100 ,   999 ,               D_FAC |UINT_RM   ,       }, /* 22 PWM风速过低 */
    {   0   ,   60  ,   99  ,               D_FAC |UINT_S    ,       }, /* 23 PWM风速检测延时 */
    {   0   ,   1   ,   1 ,                 D_FAC |UINT_0    ,       }, /* 24 待机检测低压 */
    {   0   ,   64  ,   100 ,               D_FAC |UINT_C    ,       }, /* 25 制热出温限制1 */
    {   0   ,   64  ,   100 ,               D_FAC |UINT_C    ,       }, /* 26 制热出温限制2 */
    {   0   ,   64  ,   100 ,               D_FAC |UINT_C    ,       }, /* 27 制热出温限制3 */
    {   0   ,   64  ,   100 ,               D_FAC |UINT_C    ,       }, /* 28 制热出温限制4 */
    {   0   ,   64  ,   100 ,               D_FAC |UINT_C    ,       }, /* 29 制热出温限制5 */
    {   20  ,   35  ,   45  ,               D_FAC |UINT_C    ,       }, /* 30 地暖过热保护 */
    {   -60,    -35,    60,                 D_FAC |UINT_0|UINT_C,    }, /* 31 禁止低压环温 */
    {   -100,   45,     100,                D_FAC |UINT_PR|D_DOT1,   }, /* 32 制冷低压过低（范围以低压量程为准） */
    {   -100,   5,      100,                D_FAC |UINT_PR|D_DOT1,   }, /* 33 制热低压过低（范围以低压量程为准） */
    {   0,      415,    1000,               D_FAC |UINT_PR|D_DOT1,   }, /* 34 制冷高压过高（范围以高压量程为准） */
    {   0,      450,    1000,               D_FAC |UINT_PR|D_DOT1,   }, /* 35 制热高压过高（范围以高压量程为准） */
    {   0,      3,      100,                D_FAC |UINT_PR|D_DOT1,   }, /* 36 低压报警复位压差 */
    {   0,      15,     100,                D_FAC |UINT_PR|D_DOT1,   }, /* 37 高压报警复位压差 */
    {   -60,    0,      60,                 D_FAC |UINT_C,           }, /* 38 低温制冷环温 */
    {   0,      300,    9999,               D_FAC |UINT_S,           }, /* 39 低温制冷检延 */
    {   0,      1,      1,                  D_FAC |UINT_0,           }, /* 40 机型设置校验 */
    {   0   ,   5  ,    100 ,               D_FAC |UINT_C    ,       }, /* 41 制冷出温限制 */
    {   0,      1,      1,                  D_FAC |UINT_0,           }, /* 42 线控器通讯检测 */
    {   0   ,   0   ,   INVT_RST_MAX-1,     D_FAC |UINT_0,           }, // 43 变频故障自复位
    {   0   ,   0 ,     80,                 D_FAC |UINT_C|D_HIDE,    }, // 44 电热热水上限
    {   -100,   -10 ,   100 ,               D_FAC |UINT_PR|D_DOT1,   }, /* 45 高压辅调回差 */
    {   -100,   2   ,   100 ,               D_FAC |UINT_PR|D_DOT1,   }, /* 46 低压辅调回差 */
};
/* ================================================================================================= */
const PARAM para_item_11[] = /* 11开关量及探头 */
{
    {   0,          1,          1,          D_PRO |UINT_0,                  },  /*  0 压机低压 */
    {   0,          1,          1,          D_PRO |UINT_0,                  },  /*  1 压机高压 */
    {   0,          1,          1,          D_PRO |UINT_0|D_HIDE,           },  /*  2 内置电热反馈 */
    {   0,          1,          1,          D_PRO |UINT_0,                  },  /*  3 水流开关 */
    {   0,          1,          1,          D_PRO |UINT_0|D_HIDE,           },  /*  4 水箱电热反馈 */
    {   0,          0,          1,          D_PRO |UINT_0,                  },  /*  5 冷媒温度修正 */
    {   -20,        0,          20,         D_PRO |UINT_RS,                 },  /*  6 冷媒气侧修正1 */
    {   -20,        0,          20 ,        D_PRO |UINT_RS,                 },  /*  7 冷媒气侧修正2 */
    {   -20,        0,          20 ,        D_PRO |UINT_RS,                 },  /*  8 冷媒气侧修正3 */
    {   -20,        0,          20 ,        D_PRO |UINT_RS,                 },  /*  9 冷媒气侧修正4 */
    {   -20,        0,          20 ,        D_PRO |UINT_RS,                 },  /* 10 冷媒气侧修正5 */
    {   -20,        0,          20 ,        D_PRO |UINT_RS,                 },  /* 11 冷媒液侧修正1 */
    {   -20,        0,          20 ,        D_PRO |UINT_RS,                 },  /* 12 冷媒液侧修正2 */
    {   -20,        0,          20 ,        D_PRO |UINT_RS,                 },  /* 13 冷媒液侧修正3 */
    {   -20,        0,          20 ,        D_PRO |UINT_RS,                 },  /* 14 冷媒液侧修正4 */
    {   -20,        0,          20 ,        D_PRO |UINT_RS,                 },  /* 15 冷媒液侧修正5 */
    {   -20,        0,          20 ,        D_PRO |UINT_RS,                 },  /* 16 冷媒液侧修正6 */
    {   -20,        0,          20 ,        D_PRO |UINT_RS,                 },  /* 17 冷媒液侧修正7 */
    {    0  ,       1,          1,          D_PRO |UINT_0|D_HIDE,           },  /* 18 水箱温度探头 */
    {    0  ,       0,          1,          D_PRO |UINT_0,                  },  /* 19 地暖进水温度探头 */
    {    0  ,       0,          1,          D_PRO |UINT_0,                  },  /* 20 系统总出水温度探头 */
    {   0,          0,          1,          D_PRO |UINT_0,                  },  /* 21 EUV信号 */
    {   0,          0,          1,          D_PRO |UINT_0,                  },  /* 22 SG信号 */
    {   0,          0,    NTC_CFG_MAX-1,    D_FAC |UINT_0|D_RNEXCH,         },  /* 23  温度探头配置 */
    {   0   ,       1,          1,          D_FAC |UINT_0|D_HIDE,           },  /* 24  单元水流开关 */
    {   0   ,       0,          1,          D_FAC |UINT_0    ,              },  /* 25  太阳能温度探头 */
    {   0,          1,          1,          D_FAC |UINT_0|D_HIDE,           },  /* 26  J5传感器类型 */
    {   0,          1,          1,          D_FAC |UINT_0|D_HIDE,           },  /* 27  J6传感器类型 */
    {   -100,       0,          100,        D_FAC |UINT_PR|D_DOT1,          },  /* 28 J5最小量程  */
    {   0,          500,        1000,       D_FAC |UINT_PR|D_DOT1,          },  /* 29 J5最大量程  */
    {   -100,       0,          100,        D_FAC |UINT_PR|D_DOT1,          },  /* 30 J6最小量程 */
    {   0,          200,        1000,       D_FAC |UINT_PR|D_DOT1,          },  /* 31 J6最大量程 */
    {    0  ,       0,          1,          D_PRO |UINT_0|D_RNEXCH,         },  /* 32 缓冲水箱上部温度探头 */
    {    0  ,       0,          1,          D_PRO |UINT_0|D_RNEXCH,         },  /* 33 缓冲水箱下部温度探头 */
    {    0  ,       4,    PRS_CFG_MAX-1,    D_FAC |UINT_0,                  },  /* 34 压力传感器配置 */
    {    0  ,       0,        30000,        D_FAC |UINT_0,                  },  /* 35 风机功率  */
    {    0  ,       0,        30000,        D_FAC |UINT_0,                  },  /* 36 水泵功率  */
    {    0  ,       0,        30000,        D_PRO |UINT_0,                  },  /* 37 电热1功率 */
    {    0  ,       0,        30000,        D_PRO |UINT_0,                  },  /* 38 电热2功率 */
    {    0  ,       0,        30000,        D_PRO |UINT_0,                  },  /* 39 待机功率 */
    {    0  ,       0,        30000,        D_PRO |UINT_0,                  },  /* 40 其他运行功率 */
    {    0  ,       1,        1,            D_FAC |UINT_0,                  },  /* 41 总出水温度探头 */
};
/* ================================================================================================= */
const PARAM para_item_12[] = /* 12调试及测试 */
{
    {   0,          0 ,    AT_MAX_NEW-1,D_FAC |UINT_0,                       }, /*  0 能力测试选择 */
    {   0,          75,     150,        D_FAC |UINT_RS,                      }, /*  1 制热压机转速A */
    {   0   ,       860 ,  FAN_FREQ_MAX,D_FAC |UINT_RM   ,                   }, /*  2 制热风机转速A */
    {-200,          1000,   1500,       D_FAC |UINT_0,                       }, /*  3 制热主阀控制A */
    {   0,          70,     150,        D_FAC |UINT_RS,                      }, /*  4 制热压机转速B */
    {   0   ,       800 ,  FAN_FREQ_MAX,D_FAC |UINT_RM   ,                   }, /*  5 制热风机转速B */
    {-200,          1000,   1500,       D_FAC |UINT_0,                       }, /*  6 制热主阀控制B */
    {   0,          70,     150,        D_FAC |UINT_RS,                      }, /*  7 制热压机转速E */
    {   0   ,       800 ,  FAN_FREQ_MAX,D_FAC |UINT_RM   ,                   }, /*  8 制热风机转速E */
    {-200,          1000,   1500,       D_FAC |UINT_0,                       }, /*  9 制热主阀控制E */
    {   0,          70,     150,        D_FAC |UINT_RS,                      }, /* 10 制热压机转速G */
    {   0   ,       800 ,  FAN_FREQ_MAX,D_FAC |UINT_RM   ,                   }, /* 11 制热风机转速G */
    {-200,          1000,   1500,       D_FAC |UINT_0,                       }, /* 12 制热主阀控制G */
    {   0,          70,     150,        D_FAC |UINT_RS,                      }, /* 13 制热压机转速C */
    {   0   ,       800 ,  FAN_FREQ_MAX,D_FAC |UINT_RM   ,                   }, /* 14 制热风机转速C */
    {-200,          1000,   1500,       D_FAC |UINT_0,                       }, /* 15 制热主阀控制C */
    {   0,          70,     150,        D_FAC |UINT_RS,                      }, /* 16 制热压机转速D */
    {   0   ,       800 ,  FAN_FREQ_MAX,D_FAC |UINT_RM   ,                   }, /* 17 制热风机转速D */
    {-200,          1000,   1500,       D_FAC |UINT_0,                       }, /* 18 制热主阀控制D */
    {   0,          70,     150,        D_FAC |UINT_RS,                      }, /* 19 制冷压机转速 */
    {   0   ,       800 ,  FAN_FREQ_MAX,D_FAC |UINT_RM   ,                   }, /* 20 制冷风机转速 */
    {-200,          1000,   1500,       D_FAC |UINT_0,                       }, /* 21 制冷主阀控制 */
    {   0   ,       6   ,   20  ,       D_FAC |UINT_C|D_DE    ,              }, /* 22 制热除霜环翅A */
    {   0,          100,    540,        D_FAC |UINT_M,                       }, /* 23 制热除霜间隔A */
    {   0,          400,    999,        D_FAC |UINT_ST,                      }, /* 24 制热除霜开度A */
    {   0   ,       70 ,    150,        D_FAC |UINT_RS   ,                   }, /* 25 制热除霜转速A */
    {   0,          5 ,     150,        D_FAC |UINT_C,                       }, /* 26 制热退除霜翅温A */
    {   0,          300,    999,        D_FAC |UINT_S,                       }, /* 27 制热除霜时间A */
    {   0   ,       6   ,   20  ,       D_FAC |UINT_C|D_DE    ,              }, /* 28 制热除霜环翅B */
    {   0,          100,    540,        D_FAC |UINT_M,                       }, /* 29 制热除霜间隔B */
    {   0,          400,    999,        D_FAC |UINT_ST,                      }, /* 30 制热除霜开度B */
    {   0   ,       70 ,    150,        D_FAC |UINT_RS   ,                   }, /* 31 制热除霜转速B */
    {   0,          5 ,     150,        D_FAC |UINT_C,                       }, /* 32 制热退除霜翅温B */
    {   0,          300,    999,        D_FAC |UINT_S,                       }, /* 33 制热除霜时间B */
    {   0   ,       6   ,   20  ,       D_FAC |UINT_C|D_DE    ,              }, /* 34 制热除霜环翅E */
    {   0,          100,    540,        D_FAC |UINT_M,                       }, /* 35 制热除霜间隔E */
    {   0,          400,    999,        D_FAC |UINT_ST,                      }, /* 36 制热除霜开度E */
    {   0   ,       70 ,    150,        D_FAC |UINT_RS   ,                   }, /* 37 制热除霜转速E */
    {   0,          5 ,     150,        D_FAC |UINT_C,                       }, /* 38 制热退除霜翅温E */
    {   0,          300,    999,        D_FAC |UINT_S,                       }, /* 39 制热除霜时间E */
    {   0   ,       6   ,   20  ,       D_FAC |UINT_C|D_DE    ,              }, /* 40 制热除霜环翅G */
    {   0,          100,    540,        D_FAC |UINT_M,                       }, /* 41 制热除霜间隔G */
    {   0,          400,    999,        D_FAC |UINT_ST,                      }, /* 42 制热除霜开度G */
    {   0   ,       70 ,    150,        D_FAC |UINT_RS   ,                   }, /* 43 制热除霜转速G */
    {   0,          5 ,     150,        D_FAC |UINT_C,                       }, /* 44 制热退除霜翅温G */
    {   0,          300,    999,        D_FAC |UINT_S,                       }, /* 45 制热除霜时间G */
    {   0,          2,  PFC_SET_MAX-1,  D_FAC |UINT_0,                       }, /* 46 PFC设置 */
    {   0,          0,      9500,       D_FAC |UINT_0,                       }, /* 47 手动变频水泵 */
};
/* ================================================================================================= */
const PARAM para_item_13[] = /* 13能量控制 */
{
    {   0  ,                60 ,       999 ,            D_FAC |UINT_S,              },  /*  0 能量控制周期 */
    {   -200,   40  ,           200 ,                   D_PRO |UINT_C|D_DE|D_DOT1,  },  /*  1 制冷加载偏差  */
    {   -200,   20  ,           200 ,                   D_PRO |UINT_C|D_DE|D_DOT1,  },  /*  2 制冷卸载偏差  */
    {   -200,   40  ,           200 ,                   D_PRO |UINT_C|D_DE|D_DOT1,  },  /*  3 制热加载偏差  */
    {   -200,   20  ,           200 ,                   D_PRO |UINT_C|D_DE|D_DOT1,  },  /*  4 制热卸载偏差  */
    {   1,          2,      10 ,                        D_PRO |UINT_C|D_DE ,        },  /*  5 室温回差  */
    {LOEST_COOL,6 ,          HIEST_COOL,                D_FAC |UINT_C,              },  /*  6 制冷回温下限 */
    {LOEST_COOL,26 ,         HIEST_COOL,                D_FAC |UINT_C,              },  /*  7 制冷回温上限 */
    {LOEST_HEAT,28 ,         HIEST_HEAT,                D_FAC |UINT_C,              },  /*  8 制热回温下限 */
    {LOEST_HEAT,55 ,         HIEST_HEAT,                D_FAC |UINT_C,              },  /*  9 制热回温上限 */
    {   COOL_RUN_ENV_LLIMIT+2 ,   -7, 25 ,              D_FAC |UINT_C,              },  /* 10 制冷最低环温 */
    {   35 ,       50,       COOL_RUN_ENV_HLIMIT-2 ,    D_FAC |UINT_C,              },  /* 11 制冷最高环温 */
    {   HEAT_RUN_ENV_LLIMIT+2 ,  -35, 15 ,              D_FAC |UINT_C,              },  /* 12 制热最低环温 */
    {   20 ,       50,      HEAT_RUN_ENV_HLIMIT-2,      D_FAC |UINT_C,              },  /* 13 制热最高环温 */
    {HOT_WATER_RUN_ENV_LLIMIT+2, -26, 5 ,               D_FAC |UINT_C,              },  /* 14 热水最低环温 */
    {   35 ,      50, HOT_WATER_RUN_ENV_HLIMIT-2 ,      D_FAC |UINT_C,              },  /* 15 热水最高环温 */
    {   20  ,      25   ,   29 ,                        D_FAC |UINT_C,              },  /* 16 自动制冷最低环 */
    {   10 ,       17   ,   17 ,                        D_FAC |UINT_C,              },  /* 17 自动制热最高环 */
    {   20  ,   25  ,       25  ,                       D_FAC |UINT_C    ,          },  /* 18 假日离家制热 */
    {   20  ,   25  ,       25  ,                       D_FAC |UINT_C    ,          },  /* 19 假日离家热水 */
    {   0   ,   0   ,       999 ,                       D_FAC |UINT_M    ,          },  /* 20 节能运行时间 */
    {   0  ,      0   ,   3 ,                           D_FAC |UINT_0,              },  /* 21 辅助电热 */
    {   0  ,   0   ,   3 ,                              D_FAC |UINT_0,              },  /* 22 外部热源 */
    {   0   ,   5   ,       10  ,                       D_FAC |UINT_C|D_DE    ,     },  /* 23 辅热开启高温差 */
    {   0   ,   2   ,       10  ,                       D_FAC |UINT_C|D_DE    ,     },  /* 24 辅热开启低温差 */
    {   IBH_L1,    1 ,     IBH_L3,                      D_PRO |UINT_0,              },  /* 25 辅助电热调档 */
    {   15  ,      30   ,  120 ,                        D_FAC |UINT_M,              },  /* 26 辅助电热开启延 */
    {   -15  ,    20   ,   50 ,                         D_FAC |UINT_C,              },  /* 27 辅助电热开环温 */
    {   2,         5   ,   10 ,                         D_FAC |UINT_C|D_DE,         },  /* 28 辅助电热开温差 */
    {   60,        90   ,   240 ,                       D_FAC |UINT_M,              },  /* 29 水箱电热开启延 */
    {   -5,        20   ,  50 ,                         D_FAC |UINT_C,              },  /* 30 水箱电热开环温 */
    {   15  ,      30   ,  120 ,                        D_FAC |UINT_M,              },  /* 31 外部热源开启延 */
    {   2,         5   ,   10 ,                         D_FAC |UINT_C|D_DE,         },  /* 32 外部热源开温差 */
    {   0  ,       0   ,   5 ,                          D_FAC |UINT_C|D_DE,         },  /* 33 外部热源关温差 */
    {   -15  ,     5   ,   10 ,                         D_FAC |UINT_C,              },  /* 34 外部热源开环温 */
    {   10 ,      90,     600,                          D_PRO |UINT_M,              },  /* 35 制热水最大时长 */
    {   10 ,      30,     600,                          D_PRO |UINT_M,              },  /* 36 制热水限制运行 */
    {   0   ,    1  ,   CPST_SET_MAX-1,                 D_FAC |UINT_0    ,          },  /* 37 能调修正对象 */
    {   0  ,     6 ,         20 ,                       D_FAC |UINT_C|D_DE,         },  /* 38 压机全开温差 */
    {   0,          380,    9000,                       D_FAC |UINT_ST,             },  /* 39 商检制热步数 */
    {   35  ,       40  ,   100 ,                       D_FAC |UINT_RS   ,          },  /* 40 商检制热频率 */
    {   0   ,       40  ,   9999 ,                      D_FAC |UINT_S,              },  /* 41 商检制热时间 */
    {   0,          230,    9000,                       D_FAC |UINT_ST,             },  /* 42 商检制冷步数 */
    {   35  ,       60  ,   100 ,                       D_FAC |UINT_RS   ,          },  /* 43 商检制冷频率 */
    {   0   ,       60  ,   9999 ,                      D_FAC |UINT_S,              },  /* 44 商检制冷时间 */
    {   0,          40  ,   9999 ,                      D_FAC |UINT_S,              },  /* 45 商检电热时间 */
    {   0  ,        600  ,  FAN_FREQ_MAX,               D_FAC |UINT_RM,             },  /* 46 商检制热风速 */
    {   0,          400,    FAN_FREQ_MAX,               D_FAC |UINT_RM,             },  /* 47 商检制冷风速 */
};
const PARAM para_item_14[] = /* 14工程设置 */
{
    {   1,          3,     PUMPF_CTRL_MAX-1,    D_FAC |UINT_0,          },  /*  0 变频水泵控制 */
    {   1,          5,          15,             D_FAC |UINT_S|D_HIDE,   },  /*  1 备用 */
    {   0  ,       3000  ,      9999,           D_FAC |UINT_RM,         },  /*  2 水泵目标转速 */
    {   0  ,        1  ,   PUMPF_MODEL_MAX-1,   D_FAC |UINT_0,          },  /*  3 变频水泵编码 */
    {   0  ,       1400  ,      9999,           D_FAC |UINT_LH,         },  /*  4 水泵目标流量 */
    {   5  ,        5   ,   120 ,               D_FAC |UINT_M,          },  /*  5 下回水泵运行 */
    {   0  ,       0,           1,              D_FAC |UINT_0,          },  /*  6 下回水泵杀菌 */
    {   0  ,       0,           1,              D_FAC |UINT_0,          },  /*  7 下回水泵定时 */
    {   25  ,       25  ,       35  ,           D_FAC |UINT_C,          },  /*  8 地暖预热温度 */
    {   10  ,       30  ,       40  ,           D_FAC |UINT_M,          },  /*  9 地暖预热间隔 */
    {   48  ,       72  ,       96  ,           D_FAC |UINT_H,          },  /* 10 地暖预热时长 */
    {   3,          5,          10,             D_FAC |UINT_C|D_DE,     },  /* 11 地暖水温回差 */
    {   0,          1,          10,             D_FAC |UINT_C|D_DE,     },  /* 12 地暖室温回差 */
    {   4  ,        8   ,       15 ,            D_FAC |UINT_D,          },  /* 13 地暖烘干前 */
    {   3  ,        5   ,       7 ,             D_FAC |UINT_D,          },  /* 14 地暖烘干中 */
    {   4  ,        5   ,       15 ,            D_FAC |UINT_D,          },  /* 15 地暖烘干后 */
    {   30  ,       45   ,      55 ,            D_FAC |UINT_C,          },  /* 16 地暖烘干温度 */
    {   0,          1,          2,              D_PRO |UINT_0,          },  /* 17 A区制冷末端 */
    {   0,          0,          2,              D_PRO |UINT_0,          },  /* 18 A区制热末端 */
    {   0,          2,          2,              D_PRO |UINT_0|D_HIDE,   },  /* 19 B区制冷末端 */
    {   0,          2,          2,              D_PRO |UINT_0|D_HIDE,   },  /* 20 B区制热末端 */
    {   0   ,       0   ,   FCU_NUM_MAX,        D_FAC |UINT_0    ,      },  /* 21 末端个数 */
    {   1   ,       101  ,      247 ,           D_FAC |UINT_0    ,      },  /* 22 末端起始地址 */
    {   0   ,        0  ,       1   ,           D_FAC |UINT_0    ,      },  /* 23 主机开启末端 */
    {   0   ,        0  ,       1   ,           D_FAC |UINT_0    ,      },  /* 24 主机关闭末端 */
    {   0   ,        0  , S_START_M_MAX-1,      D_FAC |UINT_0    ,      },  /* 25 末端开启主机 */
    {   0   ,        0  , FCU_MODE_MAX-1,       D_FAC |UINT_0    ,      },  /* 26 主末模式设置 */
    {   0   ,        0  ,       10  ,           D_FAC |UINT_C|D_DE    , },  /* 27 末端能调修正 */
    {   40  ,       70  ,       80  ,           D_FAC |UINT_C    ,      },  /* 28 太阳能热水水温 */
    {   0   ,       5   ,       10  ,           D_FAC |UINT_C|D_DE    , },  /* 29 太阳能热水回差 */
    {   40  ,       62  ,       80  ,           D_FAC |UINT_C    ,      },  /* 30 太阳能开启水温 */
    {   0   ,       5   ,       10  ,           D_FAC |UINT_C|D_DE    , },  /* 31 太阳能开启回差 */
    {   0   ,       0   ,       1   ,           D_PRO |UINT_0    ,      },  /* 32 收氟功能设置 */
    {   0   ,       400 ,       500 ,           D_FAC |UINT_ST   ,      },  /* 33 收氟主阀步数 */
    {   0   ,       0   ,       500 ,           D_FAC |UINT_S    ,      },  /* 34 收氟低压延退 */
    {  180  , S3V_MIN_PERIOD,   999 ,           D_FAC |UINT_S       ,   },  /* 35 S3V3动作周期 */
    {   0  ,    S3V_MIN_ON,     999 ,           D_PRO |UINT_S|D_HIDE,   },  /* 36 外循环最小时间 */
    {   90  ,       210   ,     300 ,           D_PRO |UINT_M|D_HIDE,   },  /* 37 备用 */
    {   5  ,        15   ,      60 ,            D_PRO |UINT_M|D_HIDE,   },  /* 38 备用 */
    {   1  ,        1  ,        8,              D_PRO |UINT_0,          },  /* 39 模块个数 */
    {   1  ,        1  ,        8  ,            D_PRO |UINT_0,          },  /* 40 热水模块数 */
    { -999  ,      0   ,       999 ,            D_FAC |UINT_0|D_HIDE,   },  /* 41 备用 */
    { -999  ,      0   ,       999 ,            D_FAC |UINT_0|D_HIDE,   },  /* 42 备用 */
    { -999  ,      0   ,       999 ,            D_FAC |UINT_0|D_HIDE,   },  /* 43 备用 */
    { -999  ,      0   ,       999 ,            D_FAC |UINT_0|D_HIDE,   },  /* 44 备用 */
    {   0,         T_8N1,      T_8E1,           D_PRO |UINT_0,          },  /* 45 BMS数据格式 */
    {   0,         B_9600,     B_57600,         D_PRO |UINT_0,          },  /* 46 BMS波特率   */
    {   1  ,       1  ,        247,             D_PRO |UINT_0,          },  /* 47 BMS通讯地址 */
};
const PARAM para_item_15[] = /* 15工况频率表 */
{
    {   0,          45,         150,        D_FAC |UINT_RS,       },/*  0 冷上环50回05 --------------- */
    {   0,          64,         150,        D_FAC |UINT_RS,       },/*  1 冷上环43回05 */
    {   0,          80,         150,        D_FAC |UINT_RS,       },/*  2 冷上环35回05 */
    {   0,          60,         150,        D_FAC |UINT_RS,       },/*  3 冷上环-5回05 */
    {   0,          45,         150,        D_FAC |UINT_RS,       },/*  4 冷上环50回15 */
    {   0,          64,         150,        D_FAC |UINT_RS,       },/*  5 冷上环43回15 */
    {   0,          70,         150,        D_FAC |UINT_RS,       },/*  6 冷上环35回15 */
    {   0,          55,         150,        D_FAC |UINT_RS,       },/*  7 冷上环-5回15 */
    {   0,          45,         150,        D_FAC |UINT_RS,       },/*  8 冷上环50回23 */
    {   0,          64,         150,        D_FAC |UINT_RS,       },/*  9 冷上环43回23 */
    {   0,          70,         150,        D_FAC |UINT_RS,       },/* 10 冷上环35回23 */
    {   0,          55,         150,        D_FAC |UINT_RS,       },/* 11 冷上环-5回23 */
    {   0,          40,         150,        D_FAC |UINT_RS,       },/* 12 冷上环50回35 */
    {   0,          52,         150,        D_FAC |UINT_RS,       },/* 13 冷上环43回35 */
    {   0,          56,         150,        D_FAC |UINT_RS,       },/* 14 冷上环35回35 */
    {   0,          46,         150,        D_FAC |UINT_RS,       },/* 15 冷上环-5回35 */
    {   0,          25,         150,        D_FAC |UINT_RS,       },/* 16 冷下环50     --------------- */
    {   0,          25,         150,        D_FAC |UINT_RS,       },/* 17 冷下环43 */
    {   0,          25,         150,        D_FAC |UINT_RS,       },/* 18 冷下环35 */
    {   0,          25,         150,        D_FAC |UINT_RS,       },/* 19 冷下环-5 */
    {   0,          62,         150,        D_FAC |UINT_RS,       },/* 20 热上环43回15 --------------- */
    {   0,          72,         150,        D_FAC |UINT_RS,       },/* 21 热上环07回15 */
    {   0,          72,         150,        D_FAC |UINT_RS,       },/* 22 热上环00回15 */
    {   0,          76,         150,        D_FAC |UINT_RS,       },/* 23 热上环-07回15 */
    {   0,          76,         150,        D_FAC |UINT_RS,       },/* 24 热上环-12回15 */
    {   0,          80,         150,        D_FAC |UINT_RS,       },/* 25 热上环-25回15 */
    {   0,          52,         150,        D_FAC |UINT_RS,       },/* 26 热上环43回30 */
    {   0,          72,         150,        D_FAC |UINT_RS,       },/* 27 热上环07回30 */
    {   0,          72,         150,        D_FAC |UINT_RS,       },/* 28 热上环00回30 */
    {   0,          78,         150,        D_FAC |UINT_RS,       },/* 29 热上环-07回30 */
    {   0,          80,         150,        D_FAC |UINT_RS,       },/* 30 热上环-12回30 */
    {   0,          80,         150,        D_FAC |UINT_RS,       },/* 31 热上环-25回30 */
    {   0,          52,         150,        D_FAC |UINT_RS,       },/* 32 热上环43回40 */
    {   0,          72,         150,        D_FAC |UINT_RS,       },/* 33 热上环07回40 */
    {   0,          72,         150,        D_FAC |UINT_RS,       },/* 34 热上环00回40 */
    {   0,          78,         150,        D_FAC |UINT_RS,       },/* 35 热上环-07回40 */
    {   0,          80,         150,        D_FAC |UINT_RS,       },/* 36 热上环-12回40 */
    {   0,          80,         150,        D_FAC |UINT_RS,       },/* 37 热上环-25回40 */
    {   0,          50,         150,        D_FAC |UINT_RS,       },/* 38 热上环43回55 */
    {   0,          72,         150,        D_FAC |UINT_RS,       },/* 39 热上环07回55 */
    {   0,          72,         150,        D_FAC |UINT_RS,       },/* 40 热上环00回55 */
    {   0,          78,         150,        D_FAC |UINT_RS,       },/* 41 热上环-07回55 */
    {   0,          80,         150,        D_FAC |UINT_RS,       },/* 42 热上环-12回55 */
    {   0,          80,         150,        D_FAC |UINT_RS,       },/* 43 热上环-25回55 */
    {   0,          25,         150,        D_FAC |UINT_RS,       },/* 44 热下环43 ------------------- */
    {   0,          25,         150,        D_FAC |UINT_RS,       },/* 45 热下环00 */
    {   0,          40,         150,        D_FAC |UINT_RS,       },/* 46 热下环-12 */
    {   0,          40,         150,        D_FAC |UINT_RS,       },/* 47 热下环-25 */
};

/* ================================================================================================= */
PARAMITEM  ParamPri[GROUP_MAX] =
{
    { sizeof(para_item_01)/sizeof(PARAM),  (PARAM *)para_item_01,  para_C[ 0],  para_F[ 0],  0x80,  0,  0,  D_USER          },
    { sizeof(para_item_02)/sizeof(PARAM),  (PARAM *)para_item_02,  para_C[ 1],  para_F[ 1],  0x80,  0,  0,  D_SER           },
    { sizeof(para_item_03)/sizeof(PARAM),  (PARAM *)para_item_03,  para_C[ 2],  para_F[ 2],  0x80,  0,  0,  D_SER           },
    { sizeof(para_item_04)/sizeof(PARAM),  (PARAM *)para_item_04,  para_C[ 3],  para_F[ 3],  0x80,  0,  0,  D_SER           },
    { sizeof(para_item_05)/sizeof(PARAM),  (PARAM *)para_item_05,  para_C[ 4],  para_F[ 4],  0x80,  0,  0,  D_SER           },
    { sizeof(para_item_06)/sizeof(PARAM),  (PARAM *)para_item_06,  para_C[ 5],  para_F[ 5],  0x80,  0,  0,  D_SER           },
    { sizeof(para_item_07)/sizeof(PARAM),  (PARAM *)para_item_07,  para_C[ 6],  para_F[ 6],  0x80,  0,  0,  D_SER           },
    { sizeof(para_item_08)/sizeof(PARAM),  (PARAM *)para_item_08,  para_C[ 7],  para_F[ 7],  0x80,  0,  0,  D_SER           },
    { sizeof(para_item_09)/sizeof(PARAM),  (PARAM *)para_item_09,  para_C[ 8],  para_F[ 8],  0x80,  0,  0,  D_SER           },
    { sizeof(para_item_10)/sizeof(PARAM),  (PARAM *)para_item_10,  para_C[ 9],  para_F[ 9],  0x80,  0,  0,  D_SER           },
    { sizeof(para_item_11)/sizeof(PARAM),  (PARAM *)para_item_11,  para_C[10],  para_F[10],  0x80,  0,  0,  D_SER           },
    { sizeof(para_item_12)/sizeof(PARAM),  (PARAM *)para_item_12,  para_C[11],  para_F[11],  0x80,  0,  0,  D_SER           },
    { sizeof(para_item_13)/sizeof(PARAM),  (PARAM *)para_item_13,  para_C[12],  para_F[12],  0x80,  0,  0,  D_SER           },
    { sizeof(para_item_14)/sizeof(PARAM),  (PARAM *)para_item_14,  para_C[13],  para_F[13],  0x80,  0,  0,  D_SER           },
    { sizeof(para_item_15)/sizeof(PARAM),  (PARAM *)para_item_15,  para_C[14],  para_F[14],  0x80,  0,  0,  D_SER           },
};

const EEDATA ParamPri_DataInfo={MEM_PARA_ADDR, (GROUP_SIZE<<1)};

