/******************************************************************************

          版权所有 (C), 2001-2014, 广州市邦普电脑技术开发有限公司

 ******************************************************************************
  文 件 名   : Hdw_Temp.h
  版 本 号   : 初稿
  作    者   : 
  生成日期   : 2016年11月7日星期一
  最近修改   :
  功能描述   : Hdw_Temp.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2016年11月7日星期一
    作    者   : 
    修改内容   : 创建文件

******************************************************************************/

/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/

#ifndef __HDW_TEMP_H__
#define __HDW_TEMP_H__





/* 采样的NTC通道 */
enum NTC_CHANNEL
{
    CH_NTC1=0,
    CH_NTC2,
    CH_NTC3,
    CH_NTC4,
    CH_NTC5,
    CH_NTC6,
    CH_NTC7,
    CH_NTC8,
    CH_NTC9,
    CH_NTC10,	/* N0004:HL055A无、HL055B有 */
    CH_TESTH,
};


             

/* 温度数据 */
enum 
{
    PGA1=0,             /* 运放01倍 */
    PGA2,               /* 运放04倍 */
    PGA3,               /* 运放16倍 */
    PGA4                /* 运放64.46倍*/
};
#define MAX_PGA_NUM     4
#define MAX_NTC_NUM     AD_IDX_MAX  /* 最大的温度通道数*/
typedef struct tagTMP
{
    U08 cnt[MAX_NTC_NUM];               /* AD采样计数器 */
    U08 PGA[MAX_NTC_NUM];               /* 运放的放大倍数 *///由于4个放大倍数都采集所以无需记录通道放大倍数 wlg
    U16 adBuf[MAX_NTC_NUM][MAX_PGA_NUM][MAX_AD_FILTER_NUM];          /* AD采样缓冲区 */
    I16 adTestDiff[MAX_PGA_NUM];                /* 运放零点误差Ad值，可为负数 */
//  I16 PTGND;                              /* pt1000零点Ad值 */                              
} TMP_DATA;                                 

/* 探头阻值表类型 */
#define NTC_PUNP_NORMAL_10K     (0)			/* 邦普 普通10K */
#define NTC_TCL_NORMAL_10K      (1)			/* TCL 普通10K */
#define NTC_TCL_DSC_5K          (2)			/* TCL 排气5K */
#define NTC_CHANGHONG_DSC_3d77K (3)			/* 长虹 排气3.77K */
#define NTC_PAIWO_NORMAL_10K    (4)			/* 派沃 普通10K */
#define NTC_NIUENTAI_NORMAL_5K  (5)		    /* 纽恩泰 5K  B值3470 */
#define NTC_NIUENTAI_DSC_50K    (6)			/* 纽恩泰 50K B值3590 */


extern U08 Hdw_Temp_NTC_Type[MAX_TEMP_NUM];
extern I16 Hdw_Temp[MAX_TEMP_NUM];  
extern I16 Hdw_debug[50];  

extern void HDW_Temp_Init(void);
extern BOL PunpGetTemp(I16 TempBuf[], U16 TempNum);

#endif /* __HDW_TEMP_H__ */
