/******************************************************************************

          版权所有 (C), 2001-2016, 广州市邦普电脑技术开发有限公司

 ******************************************************************************
  文 件 名   : Hdw_Main.c
  版 本 号   : 初稿
  作    者   : 周志鹏
  生成日期   : 2016年11月9日星期三
  最近修改   :
  功能描述   : 硬件层主调度
  函数列表   :
  修改历史   :
  1.日    期   : 2016年11月9日星期三
    作    者   : 周志鹏
    修改内容   : 创建文件

******************************************************************************/

/*-----------------包含头文件 -----------------------------*/
#include "includes.h"

/*-----------------外部变量说明----------------------------*/



/*-----------------外部函数原型说明------------------------*/
extern void HDW_Ai_Init(void);
extern void HDW_Cur_Init(void);
extern void HDW_Temp_Init(void);
extern void HDW_SetDo(void);
//extern void HDW_GetAllAi(void);
extern void HDW_GetAllCur(void);
extern void HDW_GetAllTemp(void);
/*-----------------内部函数原型说明------------------------*/



/*-----------------全局变量--------------------------------*/



/*-----------------模块级变量------------------------------*/



/*-----------------常量定义--------------------------------*/



/*-----------------宏定义 ---------------------------------*/

void HDW_Init(void)
{
    HDW_Adcinit();
    //HDW_Ai_Init();
    //HDW_Cur_Init();
    HDW_Temp_Init();
//  CC2_vStartTmr_CC2_TIMER_8();
}


void HDW_Main(void)
{
    WDG_Refresh();
    HDW_SetDo();
//    HDW_GetAllAi();
//  HDW_GetAllCur();
    HDW_GetAllTemp();
    HDW_PwmInDutyCal();
#ifdef USE_HDW_DEBUG
    DBG_Main();
#endif    
}

